Attribute VB_Name = "Module_Лист3"
' Лист 3 - Активы

' Отработка по нажатию кнопки
Sub Оперативная_бизнес_справка()
  
Dim rowCount, RowNumber, RowCount_предидущая_Дата_из_Indicators, RowCount_начальная_Дата_месяца_из_Indicators, RowCount_начальная_Дата_года_из_Indicators As Integer
Dim максимальная_Дата_выдачи_кредита, начальная_Дата_месяца, пред_максимальная_Дата_выдачи_кредита, начальная_Дата_года As Date
' Портфели
Dim Тюменский_ПК_Факт_руб, Тюменский_ПК_Факт_руб_пред, Тюменский_ПК_Выдачи_Месяц_руб, Тюменский_ПК_Выдачи_Дата_руб, Сургутский_ПК_Факт_руб, Сургутский_ПК_Выдачи_Месяц_руб, Сургутский_ПК_Выдачи_Дата_руб, Нижневартовский_ПК_Факт_руб, Нижневартовский_ПК_Выдачи_Месяц_руб, Нижневартовский_ПК_Выдачи_Дата_руб, Новоуренгойский_ПК_Факт_руб, Новоуренгойский_ПК_Выдачи_Месяц_руб, Новоуренгойский_ПК_Выдачи_Дата_руб, ТаркоСале_ПК_Факт_руб, ТаркоСале_ПК_Выдачи_Месяц_руб, ТаркоСале_ПК_Выдачи_Дата_руб, ИЦ_Факт_руб, ИЦ_Выдачи_Месяц_руб, ИЦ_628400_Выдачи_Месяц_руб, ИЦ_Выдачи_Дата_руб, ИЦ_628400_Выдачи_Дата_руб As Double

' Программа кредитования - Выдачи в целевых сегментах за месяц
Dim Тюменский_ПК_Выдачи_Месяц_руб_PA, Тюменский_ПК_Выдачи_Месяц_руб_ОПК, Тюменский_ПК_Выдачи_Месяц_руб_Спецкомпании, Тюменский_ПК_Выдачи_Месяц_руб_Госслужащие, Тюменский_ПК_Выдачи_Месяц_руб_Зеленые, Тюменский_ПК_Выдачи_Месяц_руб_Зарплатный_продукт, Тюменский_ПК_Выдачи_Месяц_руб_Особые_отношения, Тюменский_ПК_Выдачи_Месяц_руб_Проверено_временем, Тюменский_ПК_Выдачи_Месяц_руб_Открытый_рынок, Тюменский_ПК_Выдачи_Месяц_руб_Турбо_деньги, Тюменский_ПК_Выдачи_Месяц_руб_Прочие_программы As Double
Dim Сургутский_ПК_Выдачи_Месяц_руб_PA, Сургутский_ПК_Выдачи_Месяц_руб_ОПК, Сургутский_ПК_Выдачи_Месяц_руб_Спецкомпании, Сургутский_ПК_Выдачи_Месяц_руб_Госслужащие, Сургутский_ПК_Выдачи_Месяц_руб_Зеленые, Сургутский_ПК_Выдачи_Месяц_руб_Зарплатный_продукт, Сургутский_ПК_Выдачи_Месяц_руб_Особые_отношения, Сургутский_ПК_Выдачи_Месяц_руб_Проверено_временем, Сургутский_ПК_Выдачи_Месяц_руб_Открытый_рынок, Сургутский_ПК_Выдачи_Месяц_руб_Турбо_деньги, Сургутский_ПК_Выдачи_Месяц_руб_Прочие_программы As Double
Dim Нижневартовский_ПК_Выдачи_Месяц_руб_PA, Нижневартовский_ПК_Выдачи_Месяц_руб_ОПК, Нижневартовский_ПК_Выдачи_Месяц_руб_Спецкомпании, Нижневартовский_ПК_Выдачи_Месяц_руб_Госслужащие, Нижневартовский_ПК_Выдачи_Месяц_руб_Зеленые, Нижневартовский_ПК_Выдачи_Месяц_руб_Зарплатный_продукт, Нижневартовский_ПК_Выдачи_Месяц_руб_Особые_отношения, Нижневартовский_ПК_Выдачи_Месяц_руб_Проверено_временем, Нижневартовский_ПК_Выдачи_Месяц_руб_Открытый_рынок, Нижневартовский_ПК_Выдачи_Месяц_руб_Турбо_деньги, Нижневартовский_ПК_Выдачи_Месяц_руб_Прочие_программы As Double
Dim Новоуренгойский_ПК_Выдачи_Месяц_руб_PA, Новоуренгойский_ПК_Выдачи_Месяц_руб_ОПК, Новоуренгойский_ПК_Выдачи_Месяц_руб_Спецкомпании, Новоуренгойский_ПК_Выдачи_Месяц_руб_Госслужащие, Новоуренгойский_ПК_Выдачи_Месяц_руб_Зеленые, Новоуренгойский_ПК_Выдачи_Месяц_руб_Зарплатный_продукт, Новоуренгойский_ПК_Выдачи_Месяц_руб_Особые_отношения, Новоуренгойский_ПК_Выдачи_Месяц_руб_Проверено_временем, Новоуренгойский_ПК_Выдачи_Месяц_руб_Открытый_рынок, Новоуренгойский_ПК_Выдачи_Месяц_руб_Турбо_деньги, Новоуренгойский_ПК_Выдачи_Месяц_руб_Прочие_программы As Double
Dim ТаркоСале_ПК_Выдачи_Месяц_руб_PA, ТаркоСале_ПК_Выдачи_Месяц_руб_ОПК, ТаркоСале_ПК_Выдачи_Месяц_руб_Спецкомпании, ТаркоСале_ПК_Выдачи_Месяц_руб_Госслужащие, ТаркоСале_ПК_Выдачи_Месяц_руб_Зеленые, ТаркоСале_ПК_Выдачи_Месяц_руб_Зарплатный_продукт, ТаркоСале_ПК_Выдачи_Месяц_руб_Особые_отношения, ТаркоСале_ПК_Выдачи_Месяц_руб_Проверено_временем, ТаркоСале_ПК_Выдачи_Месяц_руб_Открытый_рынок, ТаркоСале_ПК_Выдачи_Месяц_руб_Турбо_деньги, ТаркоСале_ПК_Выдачи_Месяц_руб_Прочие_программы As Double

' Штуки
Dim Тюменский_ПК_Выдачи_Дата_шт, Сургутский_ПК_Выдачи_Дата_шт, Нижневартовский_ПК_Выдачи_Дата_шт, Новоуренгойский_ПК_Выдачи_Дата_шт, ТаркоСале_ПК_Выдачи_Дата_шт, ИЦ_Выдачи_Дата_шт, ИЦ_628400_Выдачи_Дата_шт As Integer
Dim Тюменский_ПК_Факт_шт, Сургутский_ПК_Факт_шт, Нижневартовский_ПК_Факт_шт, Новоуренгойский_ПК_Факт_шт, ТаркоСале_ПК_Факт_шт, ИЦ_Факт_шт As Integer
Dim Тюменский_ПК_Выдачи_Месяц_шт, Сургутский_ПК_Выдачи_Месяц_шт, Нижневартовский_ПК_Выдачи_Месяц_шт, Новоуренгойский_ПК_Выдачи_Месяц_шт, ТаркоСале_ПК_Выдачи_Месяц_шт, ИЦ_Выдачи_Месяц_шт, ИЦ_628400_Выдачи_Месяц_шт As Integer

Dim Тюменский_ПК_Выдачи_Месяц_шт_PA, Сургутский_ПК_Выдачи_Месяц_шт_PA, Нижневартовский_ПК_Выдачи_Месяц_шт_PA, Новоуренгойский_ПК_Выдачи_Месяц_шт_PA, ТаркоСале_ПК_Выдачи_Месяц_шт_PA As Integer

' Неделя штуки и рубли
Dim Тюменский_ПК_Выдачи_Неделя_руб, Сургутский_ПК_Выдачи_Неделя_руб, Нижневартовский_ПК_Выдачи_Неделя_руб, Новоуренгойский_ПК_Выдачи_Неделя_руб, ТаркоСале_ПК_Выдачи_Неделя_руб, ИЦ_Выдачи_Неделя_руб, ИЦ_628400_Выдачи_Неделя_руб As Double
Dim Тюменский_ПК_Выдачи_Неделя_шт, Сургутский_ПК_Выдачи_Неделя_шт, Нижневартовский_ПК_Выдачи_Неделя_шт, Новоуренгойский_ПК_Выдачи_Неделя_шт, ТаркоСале_ПК_Выдачи_Неделя_шт, ИЦ_Выдачи_Неделя_шт, ИЦ_628400_Выдачи_Неделя_шт As Integer

' Квартал штуки и рубли
Dim Тюменский_ПК_Выдачи_Квартал_руб, Сургутский_ПК_Выдачи_Квартал_руб, Нижневартовский_ПК_Выдачи_Квартал_руб, Новоуренгойский_ПК_Выдачи_Квартал_руб, ТаркоСале_ПК_Выдачи_Квартал_руб, ИЦ_Выдачи_Квартал_руб, ИЦ_628400_Выдачи_Квартал_руб As Double
Dim Тюменский_ПК_Выдачи_Квартал_шт, Сургутский_ПК_Выдачи_Квартал_шт, Нижневартовский_ПК_Выдачи_Квартал_шт, Новоуренгойский_ПК_Выдачи_Квартал_шт, ТаркоСале_ПК_Выдачи_Квартал_шт, ИЦ_Выдачи_Квартал_шт, ИЦ_628400_Выдачи_Квартал_шт As Integer

' Даты отчетов
Dim dateBeginWeek, dateEndWeek, dateBeginQuarter As Date
Dim workingDaysMonth As Byte
Dim finishProcess As Boolean
Dim CheckFormatReportResult As String

Dim Форма_2_1_Range_str, Форма_2_2_Range_str As String
Dim Форма_2_1_Range_Row, Форма_2_1_Range_Column, Форма_2_2_Range_Row, Форма_2_2_Range_Column As Byte

' Индиктор вызова процедур setК_порInЕСУП, currentК_порInЕСУП
Dim call_setК_порInЕСУП, call_currentК_порInЕСУП As Boolean

' Программа выдачи кредита определена в отчете
Dim Определена_программа_выдачи As Boolean

  ' Открыть файл с отчетом - Объем кредитного портфеля с изменениями за период
  FileName = Application.GetOpenFilename("Excel Files (*.xml), *.xml", , "Открытие файла с отчетом")

  ' Если файл был выбран
  If (Len(FileName) > 5) Then
  
    ' Выводим для инфо данные об имени файла
    DBstrName_String = Dir(FileName)
  
    ' Переходим текущую форму
    ThisWorkbook.Sheets("Лист3").Activate
 
    ' Открываем выбранную книгу (UpdateLinks:=0)
    Workbooks.Open FileName, 0
            
    ' Проверка формы отчета
    CheckFormatReportResult = CheckFormatReport(DBstrName_String, "Объем КП", 3, periodFromSheet("Лист3"))
    
    If CheckFormatReportResult = "OK" Then
    
    ' Удаляем старый отчет, имя которого есть в "Q3" "C:\Users\proschaevsf\Documents\#DB_Result\Out\Выдачи и портфель ИЦ 15-04-21.xlsx"
    If Dir(ThisWorkbook.Sheets("Лист3").Range("Q3").Value) <> "" Then
    
      ' Берем дату из W1, преобразуем ее в строку "ДД-ММ-ГГГГ"
      ' Если эту дату не находим в текущем имени файла-отчета, то удаляем файл с отчетом на диске (значит это старый отчет)
      If InStr(ThisWorkbook.Sheets("Лист3").Range("Q3").Value, strДД_MM_YYYY(ThisWorkbook.Sheets("Лист3").Range("W1").Value)) = 0 Then
        ' Удаляем старый отчет на диске
        Kill ThisWorkbook.Sheets("Лист3").Range("Q3").Value
      End If
      
    End If
    
    ' Конец обработки
    finishProcess = False
    
    ' Открываем базу BASE\Indicators.xlsx
    ' Workbooks.Open (ThisWorkbook.Path + "\Base\Indicators.xlsx")
    OpenBookInBase ("Indicators")

    ' Открываем BASE\Tasks
    OpenBookInBase ("Tasks")

    ' Переходим текущую форму
    ThisWorkbook.Sheets("Лист3").Activate
    
    ' Форма 2.1 (Месяц, Неделя, День)
    Форма_2_1_Range_str = RangeByValue(ThisWorkbook.Name, "Лист3", "Форма 2.1", 100, 100)
    Форма_2_1_Range_Row = Workbooks(ThisWorkbook.Name).Sheets("Лист3").Range(Форма_2_1_Range_str).Row
    Форма_2_1_Range_Column = Workbooks(ThisWorkbook.Name).Sheets("Лист3").Range(Форма_2_1_Range_str).Column

    ' Форма 2.2 (Квартал, Месяц, Неделя, День)
    Форма_2_2_Range_str = RangeByValue(ThisWorkbook.Name, "Лист3", "Форма 2.2", 100, 100)
    Форма_2_2_Range_Row = Workbooks(ThisWorkbook.Name).Sheets("Лист3").Range(Форма_2_2_Range_str).Row
    Форма_2_2_Range_Column = Workbooks(ThisWorkbook.Name).Sheets("Лист3").Range(Форма_2_2_Range_str).Column

    ' Производим обработку на Листе
    ' 1. Найдем максимальную дату в которой выдавался кредит - Дата выдачи кредита (H)
    ' Строка статуса
    Application.StatusBar = "Определение даты ..."
    ' Начинаем со восьмой строки
    rowCount = 8
    максимальная_Дата_выдачи_кредита = Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value
    пред_максимальная_Дата_выдачи_кредита = максимальная_Дата_выдачи_кредита
    
    ' Здесь идем по столбцу "Филиал", в котором должно быть "Тюменский ОО1"
    Do While (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 1).Value = "Головной банк")
      
      ' Провряем дату, если больше то присваиваем в переменную. Есть записи, в которых выдача есть, а сумма =0. Поэтому берем еще и значение выдачи <> 0 (Столбец K - 11)
      If (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value > максимальная_Дата_выдачи_кредита) And (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 11).Value <> 0) Then
        пред_максимальная_Дата_выдачи_кредита = максимальная_Дата_выдачи_кредита
        максимальная_Дата_выдачи_кредита = Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value
      End If
        
      ' Следующая запись
      ' DoEventsInterval (RowCount)
      rowCount = rowCount + 1
    Loop ' Обработка строк в цикле

    ' Начальная дата текущего месяца
    начальная_Дата_месяца = CDate("01." + Mid(CStr(максимальная_Дата_выдачи_кредита), 4, 7))
    
    ' Тема письма
    ' ThisWorkbook.Sheets("Лист3").Cells(2, 16).Value = "Оперативная бизнес-справка (активы) на " + CStr(максимальная_Дата_выдачи_кредита) + " г."
    ThisWorkbook.Sheets("Лист3").Cells(2, 16).Value = "Оперативная бизнес-справка (активы) на " + CStr(ThisWorkbook.Sheets("Лист3").Range("W1").Value) + " г."
    
    ' Начальная дата текущего года
    начальная_Дата_года = CDate("01.01." + Mid(CStr(максимальная_Дата_выдачи_кредита), 7, 4))
    
    ' Дата начала недели
    dateBeginWeek = weekStartDate(максимальная_Дата_выдачи_кредита)
    
    ' Дата конца недели
    dateEndWeek = weekEndDate(максимальная_Дата_выдачи_кредита)

    ' Число рабочих дней в месяце
    workingDaysMonth = Working_days_in_the_FullMonth(максимальная_Дата_выдачи_кредита, 6)

    ' Дата начала месяца
    dateBeginMonth = CDate("01." + Mid(CStr(максимальная_Дата_выдачи_кредита), 4, 7))

    ' Неделя
    ThisWorkbook.Sheets("Лист3").Cells(2, 10).Value = CStr(WeekNumber(максимальная_Дата_выдачи_кредита))

    ' Дата начала квартала (для рассчета накопительным по кварталу)
    dateBeginQuarter = quarterStartDate(максимальная_Дата_выдачи_кредита)

    ' Заголовок столбца ЕСУП (неделя)
    If НеделяНаЛистеN("ЕСУП") = WeekNumber(максимальная_Дата_выдачи_кредита) Then
      ThisWorkbook.Sheets("ЕСУП").Cells(6, 4).Value = "Факт нед.(" + CStr(WeekNumber(максимальная_Дата_выдачи_кредита)) + ")"
      ThisWorkbook.Sheets("ЕСУП").Cells(17, 4).Value = "Факт нед.(" + CStr(WeekNumber(максимальная_Дата_выдачи_кредита)) + ")"
    End If
        
    ' Индиктор вызова процедур setК_порInЕСУП, currentК_порInЕСУП
    call_setК_порInЕСУП = False
    call_currentК_порInЕСУП = False
    
    ' 2. Находим предидущую дату (эта дата должна быть меньше чем максимальная_Дата_выдачи_кредита) из BASE\Indicators и берем из нее показатели
    Application.StatusBar = "Определение изменений ..."
    rowCount = 2
    RowCount_начальная_Дата_месяца_из_Indicators = 0
    RowCount_предидущая_Дата_из_Indicators = 0
    RowCount_начальная_Дата_года_из_Indicators = 0
    предидущая_Дата_из_Indicators = CDate("01.01.2000")
    начальная_Дата_года_из_Indicators = CDate("01.01.2100")
    Do While Not IsEmpty(Workbooks("Indicators").Sheets("Лист1").Cells(rowCount, 1).Value)
      ' Проверяем дату
      If (Workbooks("Indicators").Sheets("Лист1").Cells(rowCount, 1).Value > предидущая_Дата_из_Indicators) And (Workbooks("Indicators").Sheets("Лист1").Cells(rowCount, 1).Value < максимальная_Дата_выдачи_кредита) Then
        предидущая_Дата_из_Indicators = Workbooks("Indicators").Sheets("Лист1").Cells(rowCount, 1).Value
        RowCount_предидущая_Дата_из_Indicators = rowCount
      End If
      ' Если это начальная_Дата_месяца
      If (Workbooks("Indicators").Sheets("Лист1").Cells(rowCount, 1).Value = начальная_Дата_месяца) Then
        RowCount_начальная_Дата_месяца_из_Indicators = rowCount
      End If
      
      ' начальная_Дата_года_из_Indicators. Если это текущий год и текущая дата меньше
      If (Workbooks("Indicators").Sheets("Лист1").Cells(rowCount, 1).Value < начальная_Дата_года_из_Indicators) And (Year(Workbooks("Indicators").Sheets("Лист1").Cells(rowCount, 1).Value) = Year(максимальная_Дата_выдачи_кредита)) Then
        начальная_Дата_года_из_Indicators = Workbooks("Indicators").Sheets("Лист1").Cells(rowCount, 1).Value
        RowCount_начальная_Дата_года_из_Indicators = rowCount
      End If
     
      ' Следующая запись
      ' DoEventsInterval (RowCount)
      rowCount = rowCount + 1
    Loop ' Обработка строк в цикле
            
    ' 3. Делаем расчет по портфелям
    ' Строка статуса
    Application.StatusBar = "Определение показателей ..."
    
    Тюменский_ПК_Факт_руб = 0
    Тюменский_ПК_Факт_шт = 0
    Тюменский_ПК_Факт_руб_пред = 0
    Тюменский_ПК_Выдачи_Месяц_руб = 0
    Тюменский_ПК_Выдачи_Месяц_шт = 0
    Тюменский_ПК_Выдачи_Дата_руб = 0
    Тюменский_ПК_Выдачи_Дата_шт = 0
    Тюменский_ПК_Выдачи_Неделя_руб = 0
    Тюменский_ПК_Выдачи_Неделя_шт = 0
    Тюменский_ПК_Выдачи_Квартал_руб = 0
    Тюменский_ПК_Выдачи_Квартал_шт = 0
    '
    Сургутский_ПК_Факт_руб = 0
    Сургутский_ПК_Факт_шт = 0
    Сургутский_ПК_Выдачи_Месяц_руб = 0
    Сургутский_ПК_Выдачи_Месяц_шт = 0
    Сургутский_ПК_Выдачи_Дата_руб = 0
    Сургутский_ПК_Выдачи_Дата_шт = 0
    Сургутский_ПК_Выдачи_Неделя_руб = 0
    Сургутский_ПК_Выдачи_Неделя_шт = 0
    '
    Нижневартовский_ПК_Факт_руб = 0
    Нижневартовский_ПК_Факт_шт = 0
    Нижневартовский_ПК_Выдачи_Месяц_руб = 0
    Нижневартовский_ПК_Выдачи_Месяц_шт = 0
    Нижневартовский_ПК_Выдачи_Дата_руб = 0
    Нижневартовский_ПК_Выдачи_Дата_шт = 0
    Нижневартовский_ПК_Выдачи_Неделя_руб = 0
    Нижневартовский_ПК_Выдачи_Неделя_шт = 0
    '
    Новоуренгойский_ПК_Факт_руб = 0
    Новоуренгойский_ПК_Факт_шт = 0
    Новоуренгойский_ПК_Выдачи_Месяц_руб = 0
    Новоуренгойский_ПК_Выдачи_Месяц_шт = 0
    Новоуренгойский_ПК_Выдачи_Дата_руб = 0
    Новоуренгойский_ПК_Выдачи_Дата_шт = 0
    Новоуренгойский_ПК_Выдачи_Неделя_руб = 0
    Новоуренгойский_ПК_Выдачи_Неделя_шт = 0
    '
    ТаркоСале_ПК_Факт_руб = 0
    ТаркоСале_ПК_Факт_шт = 0
    ТаркоСале_ПК_Выдачи_Месяц_руб = 0
    ТаркоСале_ПК_Выдачи_Месяц_шт = 0
    ТаркоСале_ПК_Выдачи_Дата_руб = 0
    ТаркоСале_ПК_Выдачи_Дата_шт = 0
    ТаркоСале_ПК_Выдачи_Неделя_руб = 0
    ТаркоСале_ПК_Выдачи_Неделя_шт = 0
    
    ' ИЦ
    ИЦ_Факт_руб = 0
    ИЦ_Факт_шт = 0
    ИЦ_Выдачи_Месяц_руб = 0
    ИЦ_Выдачи_Месяц_шт = 0
    ИЦ_Выдачи_Дата_руб = 0
    ИЦ_Выдачи_Дата_шт = 0
    ИЦ_Выдачи_Неделя_руб = 0
    ИЦ_Выдачи_Неделя_шт = 0
    ИЦ_Выдачи_Квартал_руб = 0
    ИЦ_Выдачи_Квартал_шт = 0
    
    ' ИЦ Сургут
    ИЦ_628400_Факт_руб = 0
    ИЦ_628400_Факт_шт = 0
    ИЦ_628400_Выдачи_Месяц_руб = 0
    ИЦ_628400_Выдачи_Месяц_шт = 0
    ИЦ_628400_Выдачи_Дата_руб = 0
    ИЦ_628400_Выдачи_Дата_шт = 0
    ИЦ_628400_Выдачи_Неделя_руб = 0
    ИЦ_628400_Выдачи_Неделя_шт = 0
    ИЦ_628400_Выдачи_Квартал_руб = 0
    ИЦ_628400_Выдачи_Квартал_шт = 0
    
    ' Квартал штуки и рубли
    Сургутский_ПК_Выдачи_Квартал_руб = 0
    Нижневартовский_ПК_Выдачи_Квартал_руб = 0
    Новоуренгойский_ПК_Выдачи_Квартал_руб = 0
    ТаркоСале_ПК_Выдачи_Квартал_руб = 0
        
    
    Сургутский_ПК_Выдачи_Квартал_шт = 0
    Нижневартовский_ПК_Выдачи_Квартал_шт = 0
    Новоуренгойский_ПК_Выдачи_Квартал_шт = 0
    ТаркоСале_ПК_Выдачи_Квартал_шт = 0

    '
    Тюменский_ПК_Выдачи_Месяц_руб_PA = 0
    Тюменский_ПК_Выдачи_Месяц_шт_PA = 0
    
    Тюменский_ПК_Выдачи_Месяц_руб_ОПК = 0
    Тюменский_ПК_Выдачи_Месяц_руб_Спецкомпании = 0
    Тюменский_ПК_Выдачи_Месяц_руб_Госслужащие = 0
    Тюменский_ПК_Выдачи_Месяц_руб_Зеленые = 0
    Тюменский_ПК_Выдачи_Месяц_руб_Зарплатный_продукт = 0
    Тюменский_ПК_Выдачи_Месяц_руб_Особые_отношения = 0
    Тюменский_ПК_Выдачи_Месяц_руб_Проверено_временем = 0
    Тюменский_ПК_Выдачи_Месяц_руб_Открытый_рынок = 0
    Тюменский_ПК_Выдачи_Месяц_руб_Турбо_деньги = 0
    Тюменский_ПК_Выдачи_Месяц_руб_Прочие_программы = 0
    
    Сургутский_ПК_Выдачи_Месяц_руб_PA = 0
    Сургутский_ПК_Выдачи_Месяц_шт_PA = 0
    
    Сургутский_ПК_Выдачи_Месяц_руб_ОПК = 0
    Сургутский_ПК_Выдачи_Месяц_руб_Спецкомпании = 0
    Сургутский_ПК_Выдачи_Месяц_руб_Госслужащие = 0
    Сургутский_ПК_Выдачи_Месяц_руб_Зеленые = 0
    Сургутский_ПК_Выдачи_Месяц_руб_Зарплатный_продукт = 0
    Сургутский_ПК_Выдачи_Месяц_руб_Особые_отношения = 0
    Сургутский_ПК_Выдачи_Месяц_руб_Проверено_временем = 0
    Сургутский_ПК_Выдачи_Месяц_руб_Открытый_рынок = 0
    Сургутский_ПК_Выдачи_Месяц_руб_Турбо_деньги = 0
    Сургутский_ПК_Выдачи_Месяц_руб_Прочие_программы = 0
    
    Нижневартовский_ПК_Выдачи_Месяц_руб_PA = 0
    Нижневартовский_ПК_Выдачи_Месяц_шт_PA = 0
    
    Нижневартовский_ПК_Выдачи_Месяц_руб_ОПК = 0
    Нижневартовский_ПК_Выдачи_Месяц_руб_Спецкомпании = 0
    Нижневартовский_ПК_Выдачи_Месяц_руб_Госслужащие = 0
    Нижневартовский_ПК_Выдачи_Месяц_руб_Зеленые = 0
    Нижневартовский_ПК_Выдачи_Месяц_руб_Зарплатный_продукт = 0
    Нижневартовский_ПК_Выдачи_Месяц_руб_Особые_отношения = 0
    Нижневартовский_ПК_Выдачи_Месяц_руб_Проверено_временем = 0
    Нижневартовский_ПК_Выдачи_Месяц_руб_Открытый_рынок = 0
    Нижневартовский_ПК_Выдачи_Месяц_руб_Турбо_деньги = 0
    Нижневартовский_ПК_Выдачи_Месяц_руб_Прочие_программы = 0
    
    Новоуренгойский_ПК_Выдачи_Месяц_руб_PA = 0
    Новоуренгойский_ПК_Выдачи_Месяц_шт_PA = 0
    
    Новоуренгойский_ПК_Выдачи_Месяц_руб_ОПК = 0
    Новоуренгойский_ПК_Выдачи_Месяц_руб_Спецкомпании = 0
    Новоуренгойский_ПК_Выдачи_Месяц_руб_Госслужащие = 0
    Новоуренгойский_ПК_Выдачи_Месяц_руб_Зеленые = 0
    Новоуренгойский_ПК_Выдачи_Месяц_руб_Зарплатный_продукт = 0
    Новоуренгойский_ПК_Выдачи_Месяц_руб_Особые_отношения = 0
    Новоуренгойский_ПК_Выдачи_Месяц_руб_Проверено_временем = 0
    Новоуренгойский_ПК_Выдачи_Месяц_руб_Открытый_рынок = 0
    Новоуренгойский_ПК_Выдачи_Месяц_руб_Турбо_деньги = 0
    Новоуренгойский_ПК_Выдачи_Месяц_руб_Прочие_программы = 0
    
    ТаркоСале_ПК_Выдачи_Месяц_руб_PA = 0
    ТаркоСале_ПК_Выдачи_Месяц_шт_PA = 0
    
    ТаркоСале_ПК_Выдачи_Месяц_руб_ОПК = 0
    ТаркоСале_ПК_Выдачи_Месяц_руб_Спецкомпании = 0
    ТаркоСале_ПК_Выдачи_Месяц_руб_Госслужащие = 0
    ТаркоСале_ПК_Выдачи_Месяц_руб_Зеленые = 0
    ТаркоСале_ПК_Выдачи_Месяц_руб_Зарплатный_продукт = 0
    ТаркоСале_ПК_Выдачи_Месяц_руб_Особые_отношения = 0
    ТаркоСале_ПК_Выдачи_Месяц_руб_Проверено_временем = 0
    ТаркоСале_ПК_Выдачи_Месяц_руб_Открытый_рынок = 0
    ТаркоСале_ПК_Выдачи_Месяц_руб_Турбо_деньги = 0
    ТаркоСале_ПК_Выдачи_Месяц_руб_Прочие_программы = 0

    ' Начинаем с восьмой строки
    rowCount = 8
    ' Здесь идем по столбцу "Филиал", в котором должно быть "Тюменский ОО1"
    Do While (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 1).Value = "Головной банк")
      
      ' Если Исходящий остаток по ссудной задолженности (X-24) <> 0
      If Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value <> 0 Then
        
        ' Если офис Тюменский (C-3) и ПК (V-22)
        If (InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 2).Value, "Тюменский") <> 0) And (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 22).Value = "Потребительский кредит") Then
          
          ' Общий портфель ПК офиса
          Тюменский_ПК_Факт_руб = Тюменский_ПК_Факт_руб + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
          
          ' Если не нуль, то считаем в шт. кредит в факте портфеля
          If Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value <> 0 Then
            Тюменский_ПК_Факт_шт = Тюменский_ПК_Факт_шт + 1
          End If
          
          ' Общий портфель офиса на пред_максимальная_Дата_выдачи_кредита
          ' If (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(RowCount, 8).Value <= пред_максимальная_Дата_выдачи_кредита) Then
          If (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value < начальная_Дата_месяца) Then
            Тюменский_ПК_Факт_руб_пред = Тюменский_ПК_Факт_руб_пред + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
          End If
          
          ' Выдачи текущего месяца
          If (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value >= начальная_Дата_месяца) And (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value <= максимальная_Дата_выдачи_кредита) Then
            Тюменский_ПК_Выдачи_Месяц_руб = Тюменский_ПК_Выдачи_Месяц_руб + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
            Тюменский_ПК_Выдачи_Месяц_шт = Тюменский_ПК_Выдачи_Месяц_шт + 1
            
            ' Программа
            Определена_программа_выдачи = False
            ' Тюменский_ПК_Выдачи_Месяц_руб_PA
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "Pre-approved") <> 0 Then
              Тюменский_ПК_Выдачи_Месяц_руб_PA = Тюменский_ПК_Выдачи_Месяц_руб_PA + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Тюменский_ПК_Выдачи_Месяц_шт_PA = Тюменский_ПК_Выдачи_Месяц_шт_PA + 1
              Определена_программа_выдачи = True
            End If
        
            ' Тюменский_ПК_Выдачи_Месяц_руб_ОПК
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "ОПК") <> 0 Then
              Тюменский_ПК_Выдачи_Месяц_руб_ОПК = Тюменский_ПК_Выдачи_Месяц_руб_ОПК + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Определена_программа_выдачи = True
            End If
            
            ' Тюменский_ПК_Выдачи_Месяц_руб_Спецкомпании
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "Специальные компании") <> 0 Then
              Тюменский_ПК_Выдачи_Месяц_руб_Спецкомпании = Тюменский_ПК_Выдачи_Месяц_руб_Спецкомпании + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Определена_программа_выдачи = True
            End If
            
            ' Тюменский_ПК_Выдачи_Месяц_руб_Госслужащие
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "Для госслужащих") <> 0 Then
              Тюменский_ПК_Выдачи_Месяц_руб_Госслужащие = Тюменский_ПК_Выдачи_Месяц_руб_Госслужащие + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Определена_программа_выдачи = True
            End If
            
            ' Тюменский_ПК_Выдачи_Месяц_руб_Зеленые
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "Зеленые компании") <> 0 Then
              Тюменский_ПК_Выдачи_Месяц_руб_Зеленые = Тюменский_ПК_Выдачи_Месяц_руб_Зеленые + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Определена_программа_выдачи = True
            End If
            
            ' Тюменский_ПК_Выдачи_Месяц_руб_Зарплатный_продукт
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "Зарплатный продукт") <> 0 Then
              Тюменский_ПК_Выдачи_Месяц_руб_Зарплатный_продукт = Тюменский_ПК_Выдачи_Месяц_руб_Зарплатный_продукт + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Определена_программа_выдачи = True
            End If
            
            ' Тюменский_ПК_Выдачи_Месяц_руб_Особые_отношения
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "Особые отношения") <> 0 Then
              Тюменский_ПК_Выдачи_Месяц_руб_Особые_отношения = Тюменский_ПК_Выдачи_Месяц_руб_Особые_отношения + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Определена_программа_выдачи = True
            End If
                        
            ' Тюменский_ПК_Выдачи_Месяц_руб_Проверено_временем
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "Проверено временем") <> 0 Then
              Тюменский_ПК_Выдачи_Месяц_руб_Проверено_временем = Тюменский_ПК_Выдачи_Месяц_руб_Проверено_временем + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Определена_программа_выдачи = True
            End If
            
            ' Тюменский_ПК_Выдачи_Месяц_руб_Открытый_рынок
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "Открытый рынок") <> 0 Then
              Тюменский_ПК_Выдачи_Месяц_руб_Открытый_рынок = Тюменский_ПК_Выдачи_Месяц_руб_Открытый_рынок + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Определена_программа_выдачи = True
            End If
            
            ' Тюменский_ПК_Выдачи_Месяц_руб_Турбо_деньги
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "Турбоденьги") <> 0 Then
              Тюменский_ПК_Выдачи_Месяц_руб_Турбо_деньги = Тюменский_ПК_Выдачи_Месяц_руб_Турбо_деньги + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Определена_программа_выдачи = True
            End If
            
            ' Тюменский_ПК_Выдачи_Месяц_руб_Прочие_программы
            If Определена_программа_выдачи = False Then
              Тюменский_ПК_Выдачи_Месяц_руб_Прочие_программы = Тюменский_ПК_Выдачи_Месяц_руб_Прочие_программы + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
            End If

          End If
          ' Выдачи за дату
          If Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value = максимальная_Дата_выдачи_кредита Then
            Тюменский_ПК_Выдачи_Дата_руб = Тюменский_ПК_Выдачи_Дата_руб + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
            Тюменский_ПК_Выдачи_Дата_шт = Тюменский_ПК_Выдачи_Дата_шт + 1
          End If
          ' Выдачи за неделю
          If (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value >= dateBeginWeek) And (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value <= dateEndWeek) Then
            Тюменский_ПК_Выдачи_Неделя_руб = Тюменский_ПК_Выдачи_Неделя_руб + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
            Тюменский_ПК_Выдачи_Неделя_шт = Тюменский_ПК_Выдачи_Неделя_шт + 1
          End If
          
          ' Выдачи текущего квартала
          If (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value >= dateBeginQuarter) And (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value <= максимальная_Дата_выдачи_кредита) Then
            Тюменский_ПК_Выдачи_Квартал_руб = Тюменский_ПК_Выдачи_Квартал_руб + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
            Тюменский_ПК_Выдачи_Квартал_шт = Тюменский_ПК_Выдачи_Квартал_шт + 1
          End If
          
        End If
        
        ' Если офис Сургутский (C-3) и ПК (V-22)
        If (InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 2).Value, "Сургутский") <> 0) And (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 22).Value = "Потребительский кредит") Then
          
          ' Общий портфель ПК офиса
          Сургутский_ПК_Факт_руб = Сургутский_ПК_Факт_руб + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
          
          ' Если сумма кредита не нуль - то считаем его в портфеле
          If Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value <> 0 Then
            Сургутский_ПК_Факт_шт = Сургутский_ПК_Факт_шт + 1
          End If
          
          ' Выдачи текущего месяца
          If (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value >= начальная_Дата_месяца) And (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value <= максимальная_Дата_выдачи_кредита) Then
            Сургутский_ПК_Выдачи_Месяц_руб = Сургутский_ПК_Выдачи_Месяц_руб + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
            Сургутский_ПК_Выдачи_Месяц_шт = Сургутский_ПК_Выдачи_Месяц_шт + 1
            
            ' Программа
            Определена_программа_выдачи = False
            ' Сургутский_ПК_Выдачи_Месяц_руб_PA
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "Pre-approved") <> 0 Then
              Сургутский_ПК_Выдачи_Месяц_руб_PA = Сургутский_ПК_Выдачи_Месяц_руб_PA + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Сургутский_ПК_Выдачи_Месяц_шт_PA = Сургутский_ПК_Выдачи_Месяц_шт_PA + 1
              Определена_программа_выдачи = True
            End If
        
            ' Сургутский_ПК_Выдачи_Месяц_руб_ОПК
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "ОПК") <> 0 Then
              Сургутский_ПК_Выдачи_Месяц_руб_ОПК = Сургутский_ПК_Выдачи_Месяц_руб_ОПК + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Определена_программа_выдачи = True
            End If
            
            ' Сургутский_ПК_Выдачи_Месяц_руб_Спецкомпании
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "Специальные компании") <> 0 Then
              Сургутский_ПК_Выдачи_Месяц_руб_Спецкомпании = Сургутский_ПК_Выдачи_Месяц_руб_Спецкомпании + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Определена_программа_выдачи = True
            End If
            
            ' Сургутский_ПК_Выдачи_Месяц_руб_Госслужащие
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "Для госслужащих") <> 0 Then
              Сургутский_ПК_Выдачи_Месяц_руб_Госслужащие = Сургутский_ПК_Выдачи_Месяц_руб_Госслужащие + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Определена_программа_выдачи = True
            End If
            
            ' Сургутский_ПК_Выдачи_Месяц_руб_Зеленые
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "Зеленые компании") <> 0 Then
              Сургутский_ПК_Выдачи_Месяц_руб_Зеленые = Сургутский_ПК_Выдачи_Месяц_руб_Зеленые + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Определена_программа_выдачи = True
            End If
            
            ' Сургутский_ПК_Выдачи_Месяц_руб_Зарплатный_продукт
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "Зарплатный продукт") <> 0 Then
              Сургутский_ПК_Выдачи_Месяц_руб_Зарплатный_продукт = Сургутский_ПК_Выдачи_Месяц_руб_Зарплатный_продукт + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Определена_программа_выдачи = True
            End If
            
            ' Сургутский_ПК_Выдачи_Месяц_руб_Особые_отношения
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "Особые отношения") <> 0 Then
              Сургутский_ПК_Выдачи_Месяц_руб_Особые_отношения = Сургутский_ПК_Выдачи_Месяц_руб_Особые_отношения + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Определена_программа_выдачи = True
            End If
                        
            ' Сургутский_ПК_Выдачи_Месяц_руб_Проверено_временем
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "Проверено временем") <> 0 Then
              Сургутский_ПК_Выдачи_Месяц_руб_Проверено_временем = Сургутский_ПК_Выдачи_Месяц_руб_Проверено_временем + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Определена_программа_выдачи = True
            End If
            
            ' Сургутский_ПК_Выдачи_Месяц_руб_Открытый_рынок
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "Открытый рынок") <> 0 Then
              Сургутский_ПК_Выдачи_Месяц_руб_Открытый_рынок = Сургутский_ПК_Выдачи_Месяц_руб_Открытый_рынок + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Определена_программа_выдачи = True
            End If
            
            ' Сургутский_ПК_Выдачи_Месяц_руб_Турбо_деньги
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "Турбоденьги") <> 0 Then
              Сургутский_ПК_Выдачи_Месяц_руб_Турбо_деньги = Сургутский_ПК_Выдачи_Месяц_руб_Турбо_деньги + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Определена_программа_выдачи = True
            End If
            
            ' Сургутский_ПК_Выдачи_Месяц_руб_Прочие_программы
            If Определена_программа_выдачи = False Then
              Сургутский_ПК_Выдачи_Месяц_руб_Прочие_программы = Сургутский_ПК_Выдачи_Месяц_руб_Прочие_программы + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
            End If

            
          End If
          ' Выдачи за дату
          If Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value = максимальная_Дата_выдачи_кредита Then
            Сургутский_ПК_Выдачи_Дата_руб = Сургутский_ПК_Выдачи_Дата_руб + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
            Сургутский_ПК_Выдачи_Дата_шт = Сургутский_ПК_Выдачи_Дата_шт + 1
          End If
          ' Выдачи за неделю
          If (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value >= dateBeginWeek) And (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value <= dateEndWeek) Then
            Сургутский_ПК_Выдачи_Неделя_руб = Сургутский_ПК_Выдачи_Неделя_руб + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
            Сургутский_ПК_Выдачи_Неделя_шт = Сургутский_ПК_Выдачи_Неделя_шт + 1
          End If
          ' Выдачи текущего квартала
          If (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value >= dateBeginQuarter) And (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value <= максимальная_Дата_выдачи_кредита) Then
            Сургутский_ПК_Выдачи_Квартал_руб = Сургутский_ПК_Выдачи_Квартал_руб + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
            Сургутский_ПК_Выдачи_Квартал_шт = Сургутский_ПК_Выдачи_Квартал_шт + 1
          End If
        
        End If
        
        ' Если офис Нижневартовский(C-3) и ПК (V-22)
        If (InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 2).Value, "Нижневартовский") <> 0) And (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 22).Value = "Потребительский кредит") Then
          
          ' Общий портфель ПК офиса
          Нижневартовский_ПК_Факт_руб = Нижневартовский_ПК_Факт_руб + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
          
          ' Если не нуль, то считаем в портфеле
          If Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value <> 0 Then
            Нижневартовский_ПК_Факт_шт = Нижневартовский_ПК_Факт_шт + 1
          End If
          
          ' Выдачи текущего месяца
          If (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value >= начальная_Дата_месяца) And (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value <= максимальная_Дата_выдачи_кредита) Then
            Нижневартовский_ПК_Выдачи_Месяц_руб = Нижневартовский_ПК_Выдачи_Месяц_руб + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
            Нижневартовский_ПК_Выдачи_Месяц_шт = Нижневартовский_ПК_Выдачи_Месяц_шт + 1
            
            ' Программа
            Определена_программа_выдачи = False
            ' Нижневартовский_ПК_Выдачи_Месяц_руб_PA
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "Pre-approved") <> 0 Then
              Нижневартовский_ПК_Выдачи_Месяц_руб_PA = Нижневартовский_ПК_Выдачи_Месяц_руб_PA + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Нижневартовский_ПК_Выдачи_Месяц_шт_PA = Нижневартовский_ПК_Выдачи_Месяц_шт_PA + 1
              Определена_программа_выдачи = True
            End If
        
            ' Нижневартовский_ПК_Выдачи_Месяц_руб_ОПК
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "ОПК") <> 0 Then
              Нижневартовский_ПК_Выдачи_Месяц_руб_ОПК = Нижневартовский_ПК_Выдачи_Месяц_руб_ОПК + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Определена_программа_выдачи = True
            End If
            
            ' Нижневартовский_ПК_Выдачи_Месяц_руб_Спецкомпании
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "Специальные компании") <> 0 Then
              Нижневартовский_ПК_Выдачи_Месяц_руб_Спецкомпании = Нижневартовский_ПК_Выдачи_Месяц_руб_Спецкомпании + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Определена_программа_выдачи = True
            End If
            
            ' Нижневартовский_ПК_Выдачи_Месяц_руб_Госслужащие
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "Для госслужащих") <> 0 Then
              Нижневартовский_ПК_Выдачи_Месяц_руб_Госслужащие = Нижневартовский_ПК_Выдачи_Месяц_руб_Госслужащие + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Определена_программа_выдачи = True
            End If
            
            ' Нижневартовский_ПК_Выдачи_Месяц_руб_Зеленые
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "Зеленые компании") <> 0 Then
              Нижневартовский_ПК_Выдачи_Месяц_руб_Зеленые = Нижневартовский_ПК_Выдачи_Месяц_руб_Зеленые + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Определена_программа_выдачи = True
            End If
            
            ' Нижневартовский_ПК_Выдачи_Месяц_руб_Зарплатный_продукт
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "Зарплатный продукт") <> 0 Then
              Нижневартовский_ПК_Выдачи_Месяц_руб_Зарплатный_продукт = Нижневартовский_ПК_Выдачи_Месяц_руб_Зарплатный_продукт + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Определена_программа_выдачи = True
            End If
            
            ' Нижневартовский_ПК_Выдачи_Месяц_руб_Особые_отношения
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "Особые отношения") <> 0 Then
              Нижневартовский_ПК_Выдачи_Месяц_руб_Особые_отношения = Нижневартовский_ПК_Выдачи_Месяц_руб_Особые_отношения + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Определена_программа_выдачи = True
            End If
                        
            ' Нижневартовский_ПК_Выдачи_Месяц_руб_Проверено_временем
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "Проверено временем") <> 0 Then
              Нижневартовский_ПК_Выдачи_Месяц_руб_Проверено_временем = Нижневартовский_ПК_Выдачи_Месяц_руб_Проверено_временем + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Определена_программа_выдачи = True
            End If
            
            ' Нижневартовский_ПК_Выдачи_Месяц_руб_Открытый_рынок
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "Открытый рынок") <> 0 Then
              Нижневартовский_ПК_Выдачи_Месяц_руб_Открытый_рынок = Нижневартовский_ПК_Выдачи_Месяц_руб_Открытый_рынок + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Определена_программа_выдачи = True
            End If
            
            ' Нижневартовский_ПК_Выдачи_Месяц_руб_Турбо_деньги
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "Турбоденьги") <> 0 Then
              Нижневартовский_ПК_Выдачи_Месяц_руб_Турбо_деньги = Нижневартовский_ПК_Выдачи_Месяц_руб_Турбо_деньги + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Определена_программа_выдачи = True
            End If
            
            ' Нижневартовский_ПК_Выдачи_Месяц_руб_Прочие_программы
            If Определена_программа_выдачи = False Then
              Нижневартовский_ПК_Выдачи_Месяц_руб_Прочие_программы = Нижневартовский_ПК_Выдачи_Месяц_руб_Прочие_программы + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
            End If

          End If
          ' Выдачи за дату
          If Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value = максимальная_Дата_выдачи_кредита Then
            Нижневартовский_ПК_Выдачи_Дата_руб = Нижневартовский_ПК_Выдачи_Дата_руб + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
            Нижневартовский_ПК_Выдачи_Дата_шт = Нижневартовский_ПК_Выдачи_Дата_шт + 1
          End If
          ' Выдачи за неделю
          If (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value >= dateBeginWeek) And (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value <= dateEndWeek) Then
            Нижневартовский_ПК_Выдачи_Неделя_руб = Нижневартовский_ПК_Выдачи_Неделя_руб + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
            Нижневартовский_ПК_Выдачи_Неделя_шт = Нижневартовский_ПК_Выдачи_Неделя_шт + 1
          End If
          ' Выдачи текущего Квартала
          If (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value >= dateBeginQuarter) And (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value <= максимальная_Дата_выдачи_кредита) Then
            Нижневартовский_ПК_Выдачи_Квартал_руб = Нижневартовский_ПК_Выдачи_Квартал_руб + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
            Нижневартовский_ПК_Выдачи_Квартал_шт = Нижневартовский_ПК_Выдачи_Квартал_шт + 1
          End If
       
        End If
        
        ' Если офис Новоуренгойский(C-3) и ПК (V-22)
        If (InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 2).Value, "Новоуренгойский") <> 0) And (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 22).Value = "Потребительский кредит") Then
          ' Общий портфель ПК офиса
          Новоуренгойский_ПК_Факт_руб = Новоуренгойский_ПК_Факт_руб + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
          
          ' Если не нуль, то считаем его в портфеле
          If Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value <> 0 Then
            Новоуренгойский_ПК_Факт_шт = Новоуренгойский_ПК_Факт_шт + 1
          End If
            
          
          ' Выдачи текущего месяца
          If (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value >= начальная_Дата_месяца) And (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value <= максимальная_Дата_выдачи_кредита) Then
            Новоуренгойский_ПК_Выдачи_Месяц_руб = Новоуренгойский_ПК_Выдачи_Месяц_руб + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
            Новоуренгойский_ПК_Выдачи_Месяц_шт = Новоуренгойский_ПК_Выдачи_Месяц_шт + 1
            
            ' Программа
            Определена_программа_выдачи = False
            
            ' Новоуренгойский_ПК_Выдачи_Месяц_руб_PA
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "Pre-approved") <> 0 Then
              Новоуренгойский_ПК_Выдачи_Месяц_руб_PA = Новоуренгойский_ПК_Выдачи_Месяц_руб_PA + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Новоуренгойский_ПК_Выдачи_Месяц_шт_PA = Новоуренгойский_ПК_Выдачи_Месяц_шт_PA + 1
              Определена_программа_выдачи = True
            End If
        
            ' Новоуренгойский_ПК_Выдачи_Месяц_руб_ОПК
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "ОПК") <> 0 Then
              Новоуренгойский_ПК_Выдачи_Месяц_руб_ОПК = Новоуренгойский_ПК_Выдачи_Месяц_руб_ОПК + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Определена_программа_выдачи = True
            End If
            
            ' Новоуренгойский_ПК_Выдачи_Месяц_руб_Спецкомпании
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "Специальные компании") <> 0 Then
              Новоуренгойский_ПК_Выдачи_Месяц_руб_Спецкомпании = Новоуренгойский_ПК_Выдачи_Месяц_руб_Спецкомпании + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Определена_программа_выдачи = True
            End If
            
            ' Новоуренгойский_ПК_Выдачи_Месяц_руб_Госслужащие
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "Для госслужащих") <> 0 Then
              Новоуренгойский_ПК_Выдачи_Месяц_руб_Госслужащие = Новоуренгойский_ПК_Выдачи_Месяц_руб_Госслужащие + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Определена_программа_выдачи = True
            End If
            
            ' Новоуренгойский_ПК_Выдачи_Месяц_руб_Зеленые
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "Зеленые компании") <> 0 Then
              Новоуренгойский_ПК_Выдачи_Месяц_руб_Зеленые = Новоуренгойский_ПК_Выдачи_Месяц_руб_Зеленые + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Определена_программа_выдачи = True
            End If
            
            ' Новоуренгойский_ПК_Выдачи_Месяц_руб_Зарплатный_продукт
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "Зарплатный продукт") <> 0 Then
              Новоуренгойский_ПК_Выдачи_Месяц_руб_Зарплатный_продукт = Новоуренгойский_ПК_Выдачи_Месяц_руб_Зарплатный_продукт + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Определена_программа_выдачи = True
            End If
            
            ' Новоуренгойский_ПК_Выдачи_Месяц_руб_Особые_отношения
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "Особые отношения") <> 0 Then
              Новоуренгойский_ПК_Выдачи_Месяц_руб_Особые_отношения = Новоуренгойский_ПК_Выдачи_Месяц_руб_Особые_отношения + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Определена_программа_выдачи = True
            End If
                        
            ' Новоуренгойский_ПК_Выдачи_Месяц_руб_Проверено_временем
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "Проверено временем") <> 0 Then
              Новоуренгойский_ПК_Выдачи_Месяц_руб_Проверено_временем = Новоуренгойский_ПК_Выдачи_Месяц_руб_Проверено_временем + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Определена_программа_выдачи = True
            End If
            
            ' Новоуренгойский_ПК_Выдачи_Месяц_руб_Открытый_рынок
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "Открытый рынок") <> 0 Then
              Новоуренгойский_ПК_Выдачи_Месяц_руб_Открытый_рынок = Новоуренгойский_ПК_Выдачи_Месяц_руб_Открытый_рынок + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Определена_программа_выдачи = True
            End If
            
            ' Новоуренгойский_ПК_Выдачи_Месяц_руб_Турбо_деньги
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "Турбоденьги") <> 0 Then
              Новоуренгойский_ПК_Выдачи_Месяц_руб_Турбо_деньги = Новоуренгойский_ПК_Выдачи_Месяц_руб_Турбо_деньги + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Определена_программа_выдачи = True
            End If
            
            ' Новоуренгойский_ПК_Выдачи_Месяц_руб_Прочие_программы
            If Определена_программа_выдачи = False Then
              Новоуренгойский_ПК_Выдачи_Месяц_руб_Прочие_программы = Новоуренгойский_ПК_Выдачи_Месяц_руб_Прочие_программы + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
            End If

            
          End If
          ' Выдачи за дату
          If Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value = максимальная_Дата_выдачи_кредита Then
            Новоуренгойский_ПК_Выдачи_Дата_руб = Новоуренгойский_ПК_Выдачи_Дата_руб + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
            Новоуренгойский_ПК_Выдачи_Дата_шт = Новоуренгойский_ПК_Выдачи_Дата_шт + 1
          End If
          ' Выдачи за неделю
          If (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value >= dateBeginWeek) And (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value <= dateEndWeek) Then
            Новоуренгойский_ПК_Выдачи_Неделя_руб = Новоуренгойский_ПК_Выдачи_Неделя_руб + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
            Новоуренгойский_ПК_Выдачи_Неделя_шт = Новоуренгойский_ПК_Выдачи_Неделя_шт + 1
          End If
          ' Выдачи за квартал
          If (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value >= dateBeginQuarter) And (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value <= максимальная_Дата_выдачи_кредита) Then
            Новоуренгойский_ПК_Выдачи_Квартал_руб = Новоуренгойский_ПК_Выдачи_Квартал_руб + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
            Новоуренгойский_ПК_Выдачи_Квартал_шт = Новоуренгойский_ПК_Выдачи_Квартал_шт + 1
          End If
        
        End If
        
        ' Если офис ТаркоСале(C-3) и ПК (V-22)
        If (InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 2).Value, "Тарко-Сале") <> 0) And (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 22).Value = "Потребительский кредит") Then
          ' Общий портфель ПК офиса
          ТаркоСале_ПК_Факт_руб = ТаркоСале_ПК_Факт_руб + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
          
          ' Если остаток не нуль, то считаем его в портфеле
          If Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value <> 0 Then
            ТаркоСале_ПК_Факт_шт = ТаркоСале_ПК_Факт_шт + 1
          End If
          
          ' Выдачи текущего месяца
          If (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value >= начальная_Дата_месяца) And (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value <= максимальная_Дата_выдачи_кредита) Then
            ТаркоСале_ПК_Выдачи_Месяц_руб = ТаркоСале_ПК_Выдачи_Месяц_руб + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
            ТаркоСале_ПК_Выдачи_Месяц_шт = ТаркоСале_ПК_Выдачи_Месяц_шт + 1
            
                        ' Программа
            Определена_программа_выдачи = False
            
            ' ТаркоСале_ПК_Выдачи_Месяц_руб_PA
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "Pre-approved") <> 0 Then
              ТаркоСале_ПК_Выдачи_Месяц_руб_PA = ТаркоСале_ПК_Выдачи_Месяц_руб_PA + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              ТаркоСале_ПК_Выдачи_Месяц_шт_PA = ТаркоСале_ПК_Выдачи_Месяц_шт_PA + 1
              Определена_программа_выдачи = True
            End If
        
            ' ТаркоСале_ПК_Выдачи_Месяц_руб_ОПК
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "ОПК") <> 0 Then
              ТаркоСале_ПК_Выдачи_Месяц_руб_ОПК = ТаркоСале_ПК_Выдачи_Месяц_руб_ОПК + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Определена_программа_выдачи = True
            End If
            
            ' ТаркоСале_ПК_Выдачи_Месяц_руб_Спецкомпании
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "Специальные компании") <> 0 Then
              ТаркоСале_ПК_Выдачи_Месяц_руб_Спецкомпании = ТаркоСале_ПК_Выдачи_Месяц_руб_Спецкомпании + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Определена_программа_выдачи = True
            End If
            
            ' ТаркоСале_ПК_Выдачи_Месяц_руб_Госслужащие
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "Для госслужащих") <> 0 Then
              ТаркоСале_ПК_Выдачи_Месяц_руб_Госслужащие = ТаркоСале_ПК_Выдачи_Месяц_руб_Госслужащие + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Определена_программа_выдачи = True
            End If
            
            ' ТаркоСале_ПК_Выдачи_Месяц_руб_Зеленые
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "Зеленые компании") <> 0 Then
              ТаркоСале_ПК_Выдачи_Месяц_руб_Зеленые = ТаркоСале_ПК_Выдачи_Месяц_руб_Зеленые + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Определена_программа_выдачи = True
            End If
            
            ' ТаркоСале_ПК_Выдачи_Месяц_руб_Зарплатный_продукт
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "Зарплатный продукт") <> 0 Then
              ТаркоСале_ПК_Выдачи_Месяц_руб_Зарплатный_продукт = ТаркоСале_ПК_Выдачи_Месяц_руб_Зарплатный_продукт + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Определена_программа_выдачи = True
            End If
            
            ' ТаркоСале_ПК_Выдачи_Месяц_руб_Особые_отношения
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "Особые отношения") <> 0 Then
              ТаркоСале_ПК_Выдачи_Месяц_руб_Особые_отношения = ТаркоСале_ПК_Выдачи_Месяц_руб_Особые_отношения + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Определена_программа_выдачи = True
            End If
                        
            ' ТаркоСале_ПК_Выдачи_Месяц_руб_Проверено_временем
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "Проверено временем") <> 0 Then
              ТаркоСале_ПК_Выдачи_Месяц_руб_Проверено_временем = ТаркоСале_ПК_Выдачи_Месяц_руб_Проверено_временем + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Определена_программа_выдачи = True
            End If
            
            ' ТаркоСале_ПК_Выдачи_Месяц_руб_Открытый_рынок
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "Открытый рынок") <> 0 Then
              ТаркоСале_ПК_Выдачи_Месяц_руб_Открытый_рынок = ТаркоСале_ПК_Выдачи_Месяц_руб_Открытый_рынок + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Определена_программа_выдачи = True
            End If
            
            ' ТаркоСале_ПК_Выдачи_Месяц_руб_Турбо_деньги
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 4).Value, "Турбоденьги") <> 0 Then
              ТаркоСале_ПК_Выдачи_Месяц_руб_Турбо_деньги = ТаркоСале_ПК_Выдачи_Месяц_руб_Турбо_деньги + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              Определена_программа_выдачи = True
            End If
            
            ' ТаркоСале_ПК_Выдачи_Месяц_руб_Прочие_программы
            If Определена_программа_выдачи = False Then
              ТаркоСале_ПК_Выдачи_Месяц_руб_Прочие_программы = ТаркоСале_ПК_Выдачи_Месяц_руб_Прочие_программы + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
            End If

            
          End If
          ' Выдачи за дату
          If Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value = максимальная_Дата_выдачи_кредита Then
            ТаркоСале_ПК_Выдачи_Дата_руб = ТаркоСале_ПК_Выдачи_Дата_руб + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
            ТаркоСале_ПК_Выдачи_Дата_шт = ТаркоСале_ПК_Выдачи_Дата_шт + 1
          End If
          ' Выдачи за неделю
          If (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value >= dateBeginWeek) And (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value <= dateEndWeek) Then
            ТаркоСале_ПК_Выдачи_Неделя_руб = ТаркоСале_ПК_Выдачи_Неделя_руб + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
            ТаркоСале_ПК_Выдачи_Неделя_шт = ТаркоСале_ПК_Выдачи_Неделя_шт + 1
          End If
          ' Выдачи за квартал
          If (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value >= dateBeginQuarter) And (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value <= максимальная_Дата_выдачи_кредита) Then
            ТаркоСале_ПК_Выдачи_Квартал_руб = ТаркоСале_ПК_Выдачи_Квартал_руб + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
            ТаркоСале_ПК_Выдачи_Квартал_шт = ТаркоСале_ПК_Выдачи_Квартал_шт + 1
          End If
        
        End If
        
        ' Если это ИЦ (любой офис)(C-3) и Ипотечный кредит (V-22)
        If (True) And (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 22).Value = "Ипотечный кредит") Then
          
          ' Общий портфель ПК офиса
          ИЦ_Факт_руб = ИЦ_Факт_руб + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
          
          ' Если остаток не нуль - считаем
          If Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value <> 0 Then
            ИЦ_Факт_шт = ИЦ_Факт_шт + 1
          End If
          
          ' ИЦ потрфель по Сургуту
          If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 2).Value, "Сургутский") Then
            ИЦ_628400_Факт_руб = ИЦ_628400_Факт_руб + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
            ' Если остаток не нуль
            If Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value <> 0 Then
              ИЦ_628400_Факт_шт = ИЦ_628400_Факт_шт + 1
            End If
          End If
          
          ' Выдачи текущего месяца
          If (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value >= начальная_Дата_месяца) And (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value <= максимальная_Дата_выдачи_кредита) Then
            ИЦ_Выдачи_Месяц_руб = ИЦ_Выдачи_Месяц_руб + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
            ИЦ_Выдачи_Месяц_шт = ИЦ_Выдачи_Месяц_шт + 1
            
            ' ИЦ Сургут
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 2).Value, "Сургутский") Then
              ИЦ_628400_Выдачи_Месяц_руб = ИЦ_628400_Выдачи_Месяц_руб + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              ИЦ_628400_Выдачи_Месяц_шт = ИЦ_628400_Выдачи_Месяц_шт + 1
            End If
            
          End If
          
          ' Выдачи за дату
          If Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value = максимальная_Дата_выдачи_кредита Then
            ИЦ_Выдачи_Дата_руб = ИЦ_Выдачи_Дата_руб + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
            ИЦ_Выдачи_Дата_шт = ИЦ_Выдачи_Дата_шт + 1
            ' ИЦ Сургут
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 2).Value, "Сургутский") Then
              ИЦ_628400_Выдачи_Дата_руб = ИЦ_628400_Выдачи_Дата_руб + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              ИЦ_628400_Выдачи_Дата_шт = ИЦ_628400_Выдачи_Дата_шт + 1
            End If
          End If
          
          ' Выдачи за неделю
          If (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value >= dateBeginWeek) And (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value <= dateEndWeek) Then
            ИЦ_Выдачи_Неделя_руб = ИЦ_Выдачи_Неделя_руб + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
            ИЦ_Выдачи_Неделя_шт = ИЦ_Выдачи_Неделя_шт + 1
            ' ИЦ Сургут
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 2).Value, "Сургутский") Then
              ИЦ_628400_Выдачи_Неделя_руб = ИЦ_628400_Выдачи_Неделя_руб + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              ИЦ_628400_Выдачи_Неделя_шт = ИЦ_628400_Выдачи_Неделя_шт + 1
            End If
          End If
          
          ' Выдачи текущего Квартала
          If (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value >= dateBeginQuarter) And (Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 8).Value <= максимальная_Дата_выдачи_кредита) Then
            ИЦ_Выдачи_Квартал_руб = ИЦ_Выдачи_Квартал_руб + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
            ИЦ_Выдачи_Квартал_шт = ИЦ_Выдачи_Квартал_шт + 1
            ' ИЦ Сургут
            If InStr(Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 2).Value, "Сургутский") Then
              ИЦ_628400_Выдачи_Квартал_руб = ИЦ_628400_Выдачи_Квартал_руб + Workbooks(DBstrName_String).Sheets("Объем КП").Cells(rowCount, 24).Value
              ИЦ_628400_Выдачи_Квартал_шт = ИЦ_628400_Выдачи_Квартал_шт + 1
            End If
            
          End If
                              
        End If
           
      End If ' Если Исходящий остаток по ссудной задолженности (X-24) <> 0
      
      ' Следующая запись
      rowCount = rowCount + 1
      Application.StatusBar = "Определение показателей: " + CStr(rowCount)
      DoEventsInterval (rowCount)
      
    Loop ' Обработка строк в цикле
    
    Application.StatusBar = "Подведение итогов ..."
    
    ' Генерация текста в заголовках
    Call generateTextInHeader(максимальная_Дата_выдачи_кредита, dateBeginWeek, dateEndWeek, начальная_Дата_года_из_Indicators, предидущая_Дата_из_Indicators)
                                
    ' Данные по ОО Тюменский (из-за ошибки error procedure too large)
    Call generateTextInBody(максимальная_Дата_выдачи_кредита, Тюменский_ПК_Факт_руб, Тюменский_ПК_Факт_шт, Тюменский_ПК_Факт_руб_пред, Тюменский_ПК_Выдачи_Месяц_руб, Тюменский_ПК_Выдачи_Месяц_шт, Тюменский_ПК_Выдачи_Дата_руб, Тюменский_ПК_Выдачи_Дата_шт, Тюменский_ПК_Выдачи_Неделя_руб, Тюменский_ПК_Выдачи_Неделя_шт, Тюменский_ПК_Выдачи_Квартал_руб, Тюменский_ПК_Выдачи_Квартал_шт)
        
    ' Вывод в таблицу Программы кредитования (из-за ошибки error procedure too large)
    Call writeInfoToTable(95, Тюменский_ПК_Выдачи_Месяц_руб_PA, _
                                Тюменский_ПК_Выдачи_Месяц_руб_ОПК, _
                                  Тюменский_ПК_Выдачи_Месяц_руб_Спецкомпании, _
                                    Тюменский_ПК_Выдачи_Месяц_руб_Госслужащие, _
                                      Тюменский_ПК_Выдачи_Месяц_руб_Зеленые, _
                                        Тюменский_ПК_Выдачи_Месяц_руб_Зарплатный_продукт, _
                                          Тюменский_ПК_Выдачи_Месяц_руб_Особые_отношения, _
                                            Тюменский_ПК_Выдачи_Месяц_руб_Проверено_временем, _
                                              Тюменский_ПК_Выдачи_Месяц_руб_Открытый_рынок, _
                                                Тюменский_ПК_Выдачи_Месяц_руб_Турбо_деньги, _
                                                  Тюменский_ПК_Выдачи_Месяц_руб_Прочие_программы)
    
    ' Вывод в таблицу Программы кредитования (из-за ошибки error procedure too large) в штуках
    Call writeInfoToTable2(95, Тюменский_ПК_Выдачи_Месяц_шт_PA)
    
    ' --- Заносим в ЕСУП (для ОО Тюменский номер строки в ЕСУП = 7)
    ' План ПК недели
    If НеделяНаЛистеN("ЕСУП") = WeekNumber(максимальная_Дата_выдачи_кредита) Then
      ThisWorkbook.Sheets("ЕСУП").Cells(7, 3).Value = ThisWorkbook.Sheets("Лист3").Cells(38, 7).Value
      ' План на неделю по выдачам ПК
      ThisWorkbook.Sheets("ЕСУП").Cells(7, 4).Value = ThisWorkbook.Sheets("Лист3").Cells(38, 8).Value
      ' Поручение офису ВПК1 - для ОО Тюменский
      Call setК_порInЕСУП(ThisWorkbook.Name, "ЕСУП", "ВПК1", ThisWorkbook.Sheets("Лист3").Cells(38, 7).Value, dateBeginWeek, "тыс.руб.", "")
      ' Переменная, что процедуру setК_порInЕСУП вызывали
      call_setК_порInЕСУП = True
    End If
    ' --- Заносим в ЕСУП ---
    
    ' --- Заносим факт исполнения ЕСУП
    If НеделяНаЛистеN("ЕСУП") = WeekNumber(максимальная_Дата_выдачи_кредита) Then
      Call currentК_порInЕСУП(ThisWorkbook.Name, "ЕСУП", "ВПК1", максимальная_Дата_выдачи_кредита, ThisWorkbook.Sheets("Лист3").Cells(38, 8).Value, "тыс.руб.")
      ' Переменная, что процедуру currentК_порInЕСУП вызывали
      call_currentК_порInЕСУП = True
    End If
    ' --- Конец Заносим факт исполнения ЕСУП
    
    ' Данные по ОО Сургутский
    ' ПК Факт на ...
    ThisWorkbook.Sheets("Лист3").Cells(7, 3).Value = Round(Сургутский_ПК_Факт_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(7, 17).Value = Сургутский_ПК_Факт_шт
    
    ThisWorkbook.Sheets("Лист3").Cells(39, 3).Value = Round(Сургутский_ПК_Факт_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(71, 3).Value = Round(Сургутский_ПК_Факт_руб / 1000, 0)
        
    ' ПК Факт месяц
    ThisWorkbook.Sheets("Лист3").Cells(7, 6).Value = Round(Сургутский_ПК_Выдачи_Месяц_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(39, 6).Value = Round(Сургутский_ПК_Выдачи_Месяц_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(71, 8).Value = Round(Сургутский_ПК_Выдачи_Месяц_руб / 1000, 0)
    ' На лист факт Плана: Месяц (1-12), офис 1-5
    Call setResultValue(Month(максимальная_Дата_выдачи_кредита), 2, Round(Сургутский_ПК_Выдачи_Месяц_руб / 1000, 0))

    ' ПК Факт дата
    ThisWorkbook.Sheets("Лист3").Cells(7, 9).Value = Round(Сургутский_ПК_Выдачи_Дата_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(7, 10).Value = Сургутский_ПК_Выдачи_Дата_шт
    ThisWorkbook.Sheets("Лист3").Cells(39, 9).Value = Round(Сургутский_ПК_Выдачи_Дата_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(39, 10).Value = Сургутский_ПК_Выдачи_Дата_шт
    ThisWorkbook.Sheets("Лист3").Cells(71, 11).Value = Round(Сургутский_ПК_Выдачи_Дата_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(71, 12).Value = Сургутский_ПК_Выдачи_Дата_шт
    
    ' План на неделю - 6 дней
    ' ThisWorkbook.Sheets("Лист3").Cells(39, 7).Value = Round(ПланНаНеделю(ThisWorkbook.Sheets("Лист3").Cells(39, 5).Value, ThisWorkbook.Sheets("Лист3").Cells(39, 6).Value - ThisWorkbook.Sheets("Лист3").Cells(39, 8).Value, максимальная_Дата_выдачи_кредита, 6), 0)
    ' План на неделю - 5 дней
    ThisWorkbook.Sheets("Лист3").Cells(39, 7).Value = Round(ПланНаНеделю(ThisWorkbook.Sheets("Лист3").Cells(39, 5).Value, ThisWorkbook.Sheets("Лист3").Cells(39, 6).Value - ThisWorkbook.Sheets("Лист3").Cells(39, 8).Value, максимальная_Дата_выдачи_кредита, 5), 0)
    ThisWorkbook.Sheets("Лист3").Cells(71, 9).Value = Round(ПланНаНеделю(ThisWorkbook.Sheets("Лист3").Cells(39, 5).Value, ThisWorkbook.Sheets("Лист3").Cells(39, 6).Value - ThisWorkbook.Sheets("Лист3").Cells(39, 8).Value, максимальная_Дата_выдачи_кредита, 5), 0)
    
    ' ПК Факт неделя
    ThisWorkbook.Sheets("Лист3").Cells(39, 8).Value = Round(Сургутский_ПК_Выдачи_Неделя_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(71, 10).Value = Round(Сургутский_ПК_Выдачи_Неделя_руб / 1000, 0)
    
    ' ПК Факт Квартал Сургут
    ThisWorkbook.Sheets("Лист3").Cells(71, 6).Value = Round(Сургутский_ПК_Выдачи_Квартал_руб / 1000, 0)
    
    ' Вывод в таблицу Программы кредитования (из-за ошибки error procedure too large)
    Call writeInfoToTable(96, Сургутский_ПК_Выдачи_Месяц_руб_PA, _
                                Сургутский_ПК_Выдачи_Месяц_руб_ОПК, _
                                  Сургутский_ПК_Выдачи_Месяц_руб_Спецкомпании, _
                                    Сургутский_ПК_Выдачи_Месяц_руб_Госслужащие, _
                                      Сургутский_ПК_Выдачи_Месяц_руб_Зеленые, _
                                        Сургутский_ПК_Выдачи_Месяц_руб_Зарплатный_продукт, _
                                          Сургутский_ПК_Выдачи_Месяц_руб_Особые_отношения, _
                                            Сургутский_ПК_Выдачи_Месяц_руб_Проверено_временем, _
                                              Сургутский_ПК_Выдачи_Месяц_руб_Открытый_рынок, _
                                                Сургутский_ПК_Выдачи_Месяц_руб_Турбо_деньги, _
                                                  Сургутский_ПК_Выдачи_Месяц_руб_Прочие_программы)

    ' Вывод в таблицу Программы кредитования (из-за ошибки error procedure too large) в штуках
    Call writeInfoToTable2(96, Сургутский_ПК_Выдачи_Месяц_шт_PA)

    
    ' Заносим в ЕСУП (для ОО Сургутский номер строки в ЕСУП = 8 и строка 39 на Листе 3)
    ' План ПК недели
    If НеделяНаЛистеN("ЕСУП") = WeekNumber(максимальная_Дата_выдачи_кредита) Then
      ThisWorkbook.Sheets("ЕСУП").Cells(8, 3).Value = ThisWorkbook.Sheets("Лист3").Cells(39, 7).Value
      ' Факт ПК недели
      ThisWorkbook.Sheets("ЕСУП").Cells(8, 4).Value = ThisWorkbook.Sheets("Лист3").Cells(39, 8).Value
      ' Поручение офису ВПК2 - для ОО Сургутский
      Call setК_порInЕСУП(ThisWorkbook.Name, "ЕСУП", "ВПК2", ThisWorkbook.Sheets("Лист3").Cells(39, 7).Value, dateBeginWeek, "тыс.руб.", "")
      ' Переменная, что процедуру setК_порInЕСУП вызывали
      call_setК_порInЕСУП = True
      ' --- Заносим в ЕСУП ---
    End If
 

    ' --- Заносим факт исполнения ЕСУП
    If НеделяНаЛистеN("ЕСУП") = WeekNumber(максимальная_Дата_выдачи_кредита) Then
      Call currentК_порInЕСУП(ThisWorkbook.Name, "ЕСУП", "ВПК2", максимальная_Дата_выдачи_кредита, ThisWorkbook.Sheets("Лист3").Cells(39, 8).Value, "тыс.руб.")
      ' Переменная, что процедуру currentК_порInЕСУП вызывали
      call_currentК_порInЕСУП = True
    End If
    ' --- Конец Заносим факт исполнения ЕСУП

    ' Данные по ОО Нижневартовский
    ' ПК Факт на ...
    ThisWorkbook.Sheets("Лист3").Cells(8, 3).Value = Round(Нижневартовский_ПК_Факт_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(8, 17).Value = Нижневартовский_ПК_Факт_шт
    
    
    ThisWorkbook.Sheets("Лист3").Cells(40, 3).Value = Round(Нижневартовский_ПК_Факт_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(72, 3).Value = Round(Нижневартовский_ПК_Факт_руб / 1000, 0)
    
    ' ПК Факт месяц
    ThisWorkbook.Sheets("Лист3").Cells(8, 6).Value = Round(Нижневартовский_ПК_Выдачи_Месяц_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(40, 6).Value = Round(Нижневартовский_ПК_Выдачи_Месяц_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(72, 8).Value = Round(Нижневартовский_ПК_Выдачи_Месяц_руб / 1000, 0)
    ' На лист факт Плана: Месяц (1-12), офис 1-5
    Call setResultValue(Month(максимальная_Дата_выдачи_кредита), 3, Round(Нижневартовский_ПК_Выдачи_Месяц_руб / 1000, 0))

    
    ' ПК Факт дата
    ThisWorkbook.Sheets("Лист3").Cells(8, 9).Value = Round(Нижневартовский_ПК_Выдачи_Дата_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(8, 10).Value = Нижневартовский_ПК_Выдачи_Дата_шт
    ThisWorkbook.Sheets("Лист3").Cells(40, 9).Value = Round(Нижневартовский_ПК_Выдачи_Дата_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(40, 10).Value = Нижневартовский_ПК_Выдачи_Дата_шт
    ThisWorkbook.Sheets("Лист3").Cells(72, 11).Value = Round(Нижневартовский_ПК_Выдачи_Дата_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(72, 12).Value = Нижневартовский_ПК_Выдачи_Дата_шт
    
    ' План на неделю - 6 дней
    ' ThisWorkbook.Sheets("Лист3").Cells(40, 7).Value = Round(ПланНаНеделю(ThisWorkbook.Sheets("Лист3").Cells(40, 5).Value, ThisWorkbook.Sheets("Лист3").Cells(40, 6).Value - ThisWorkbook.Sheets("Лист3").Cells(40, 8).Value, максимальная_Дата_выдачи_кредита, 6), 0)
    ' План на неделю - 5 дней
    ThisWorkbook.Sheets("Лист3").Cells(40, 7).Value = Round(ПланНаНеделю(ThisWorkbook.Sheets("Лист3").Cells(40, 5).Value, ThisWorkbook.Sheets("Лист3").Cells(40, 6).Value - ThisWorkbook.Sheets("Лист3").Cells(40, 8).Value, максимальная_Дата_выдачи_кредита, 5), 0)
    ThisWorkbook.Sheets("Лист3").Cells(72, 9).Value = Round(ПланНаНеделю(ThisWorkbook.Sheets("Лист3").Cells(40, 5).Value, ThisWorkbook.Sheets("Лист3").Cells(40, 6).Value - ThisWorkbook.Sheets("Лист3").Cells(40, 8).Value, максимальная_Дата_выдачи_кредита, 5), 0)
    
    ' ПК Факт неделя
    ThisWorkbook.Sheets("Лист3").Cells(40, 8).Value = Round(Нижневартовский_ПК_Выдачи_Неделя_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(72, 10).Value = Round(Нижневартовский_ПК_Выдачи_Неделя_руб / 1000, 0)

    ' ПК Факт Квартал
    ThisWorkbook.Sheets("Лист3").Cells(72, 6).Value = Round(Нижневартовский_ПК_Выдачи_Квартал_руб / 1000, 0)
    
        ' Вывод в таблицу Программы кредитования (из-за ошибки error procedure too large)
    Call writeInfoToTable(97, Нижневартовский_ПК_Выдачи_Месяц_руб_PA, _
                                Нижневартовский_ПК_Выдачи_Месяц_руб_ОПК, _
                                  Нижневартовский_ПК_Выдачи_Месяц_руб_Спецкомпании, _
                                    Нижневартовский_ПК_Выдачи_Месяц_руб_Госслужащие, _
                                      Нижневартовский_ПК_Выдачи_Месяц_руб_Зеленые, _
                                        Нижневартовский_ПК_Выдачи_Месяц_руб_Зарплатный_продукт, _
                                          Нижневартовский_ПК_Выдачи_Месяц_руб_Особые_отношения, _
                                            Нижневартовский_ПК_Выдачи_Месяц_руб_Проверено_временем, _
                                              Нижневартовский_ПК_Выдачи_Месяц_руб_Открытый_рынок, _
                                                Нижневартовский_ПК_Выдачи_Месяц_руб_Турбо_деньги, _
                                                  Нижневартовский_ПК_Выдачи_Месяц_руб_Прочие_программы)

    
    ' Вывод в таблицу Программы кредитования (из-за ошибки error procedure too large) в штуках
    Call writeInfoToTable2(97, Нижневартовский_ПК_Выдачи_Месяц_шт_PA)

    
    ' Заносим в ЕСУП (для ОО Нижневартовский номер строки в ЕСУП = 9 и строка 40 на Листе 3)
    If НеделяНаЛистеN("ЕСУП") = WeekNumber(максимальная_Дата_выдачи_кредита) Then
      ' План ПК неделя
      ThisWorkbook.Sheets("ЕСУП").Cells(9, 3).Value = ThisWorkbook.Sheets("Лист3").Cells(40, 7).Value
      ' Факт ПК неделя
      ThisWorkbook.Sheets("ЕСУП").Cells(9, 4).Value = ThisWorkbook.Sheets("Лист3").Cells(40, 8).Value
      ' Поручение офису ВПК3 - для ОО Нижневартовский
      Call setК_порInЕСУП(ThisWorkbook.Name, "ЕСУП", "ВПК3", ThisWorkbook.Sheets("Лист3").Cells(40, 7).Value, dateBeginWeek, "тыс.руб.", "")
      ' Переменная, что процедуру setК_порInЕСУП вызывали
      call_setК_порInЕСУП = True
    End If
    ' --- Заносим в ЕСУП ---

    ' --- Заносим факт исполнения ЕСУП
    If НеделяНаЛистеN("ЕСУП") = WeekNumber(максимальная_Дата_выдачи_кредита) Then
      Call currentК_порInЕСУП(ThisWorkbook.Name, "ЕСУП", "ВПК3", максимальная_Дата_выдачи_кредита, ThisWorkbook.Sheets("Лист3").Cells(40, 8).Value, "тыс.руб.")
       ' Переменная, что процедуру currentК_порInЕСУП вызывали
      call_currentК_порInЕСУП = True
    End If
    ' --- Конец Заносим факт исполнения ЕСУП

    ' Данные по ОО Новоуренгойский
    ' ПК Факт на ...
    ThisWorkbook.Sheets("Лист3").Cells(9, 3).Value = Round(Новоуренгойский_ПК_Факт_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(9, 17).Value = Новоуренгойский_ПК_Факт_шт
    
    
    ThisWorkbook.Sheets("Лист3").Cells(41, 3).Value = Round(Новоуренгойский_ПК_Факт_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(73, 3).Value = Round(Новоуренгойский_ПК_Факт_руб / 1000, 0)
    
    ' ПК Факт месяц
    ThisWorkbook.Sheets("Лист3").Cells(9, 6).Value = Round(Новоуренгойский_ПК_Выдачи_Месяц_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(41, 6).Value = Round(Новоуренгойский_ПК_Выдачи_Месяц_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(73, 8).Value = Round(Новоуренгойский_ПК_Выдачи_Месяц_руб / 1000, 0)
    ' На лист факт Плана: Месяц (1-12), офис 1-5
    Call setResultValue(Month(максимальная_Дата_выдачи_кредита), 4, Round(Новоуренгойский_ПК_Выдачи_Месяц_руб / 1000, 0))

    
    ' ПК Факт дата
    ThisWorkbook.Sheets("Лист3").Cells(9, 9).Value = Round(Новоуренгойский_ПК_Выдачи_Дата_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(9, 10).Value = Новоуренгойский_ПК_Выдачи_Дата_шт
    ThisWorkbook.Sheets("Лист3").Cells(41, 9).Value = Round(Новоуренгойский_ПК_Выдачи_Дата_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(41, 10).Value = Новоуренгойский_ПК_Выдачи_Дата_шт
    ThisWorkbook.Sheets("Лист3").Cells(73, 11).Value = Round(Новоуренгойский_ПК_Выдачи_Дата_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(73, 12).Value = Новоуренгойский_ПК_Выдачи_Дата_шт
    
    ' План на неделю - 6 дней
    ' ThisWorkbook.Sheets("Лист3").Cells(41, 7).Value = Round(ПланНаНеделю(ThisWorkbook.Sheets("Лист3").Cells(41, 5).Value, ThisWorkbook.Sheets("Лист3").Cells(41, 6).Value - ThisWorkbook.Sheets("Лист3").Cells(41, 8).Value, максимальная_Дата_выдачи_кредита, 6), 0)
    ' План на неделю - 5 дней
    ThisWorkbook.Sheets("Лист3").Cells(41, 7).Value = Round(ПланНаНеделю(ThisWorkbook.Sheets("Лист3").Cells(41, 5).Value, ThisWorkbook.Sheets("Лист3").Cells(41, 6).Value - ThisWorkbook.Sheets("Лист3").Cells(41, 8).Value, максимальная_Дата_выдачи_кредита, 5), 0)
    ThisWorkbook.Sheets("Лист3").Cells(73, 9).Value = Round(ПланНаНеделю(ThisWorkbook.Sheets("Лист3").Cells(41, 5).Value, ThisWorkbook.Sheets("Лист3").Cells(41, 6).Value - ThisWorkbook.Sheets("Лист3").Cells(41, 8).Value, максимальная_Дата_выдачи_кредита, 5), 0)
    
    ' ПК Факт неделя
    ThisWorkbook.Sheets("Лист3").Cells(41, 8).Value = Round(Новоуренгойский_ПК_Выдачи_Неделя_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(73, 10).Value = Round(Новоуренгойский_ПК_Выдачи_Неделя_руб / 1000, 0)
        
    ' ПК Факт Квартал
    ThisWorkbook.Sheets("Лист3").Cells(73, 6).Value = Round(Новоуренгойский_ПК_Выдачи_Квартал_руб / 1000, 0)
                    
    ' Вывод в таблицу Программы кредитования (из-за ошибки error procedure too large)
    Call writeInfoToTable(98, Новоуренгойский_ПК_Выдачи_Месяц_руб_PA, _
                                Новоуренгойский_ПК_Выдачи_Месяц_руб_ОПК, _
                                  Новоуренгойский_ПК_Выдачи_Месяц_руб_Спецкомпании, _
                                    Новоуренгойский_ПК_Выдачи_Месяц_руб_Госслужащие, _
                                      Новоуренгойский_ПК_Выдачи_Месяц_руб_Зеленые, _
                                        Новоуренгойский_ПК_Выдачи_Месяц_руб_Зарплатный_продукт, _
                                          Новоуренгойский_ПК_Выдачи_Месяц_руб_Особые_отношения, _
                                            Новоуренгойский_ПК_Выдачи_Месяц_руб_Проверено_временем, _
                                              Новоуренгойский_ПК_Выдачи_Месяц_руб_Открытый_рынок, _
                                                Новоуренгойский_ПК_Выдачи_Месяц_руб_Турбо_деньги, _
                                                  Новоуренгойский_ПК_Выдачи_Месяц_руб_Прочие_программы)
                    
                    
    ' Вывод в таблицу Программы кредитования (из-за ошибки error procedure too large) в штуках
    Call writeInfoToTable2(98, Новоуренгойский_ПК_Выдачи_Месяц_шт_PA)
                    
    ' Заносим в ЕСУП (для ОО Новоуренгойский номер строки в ЕСУП = 10 и строка 41 на Листе 3)
    If НеделяНаЛистеN("ЕСУП") = WeekNumber(максимальная_Дата_выдачи_кредита) Then
      ' План ПК неделя
      ThisWorkbook.Sheets("ЕСУП").Cells(10, 3).Value = ThisWorkbook.Sheets("Лист3").Cells(41, 7).Value
      ' Факт ПК неделя
      ThisWorkbook.Sheets("ЕСУП").Cells(10, 4).Value = ThisWorkbook.Sheets("Лист3").Cells(41, 8).Value
      ' Поручение офису ВПК4 - для ОО Новоуренгойский
      Call setК_порInЕСУП(ThisWorkbook.Name, "ЕСУП", "ВПК4", ThisWorkbook.Sheets("Лист3").Cells(41, 7).Value, dateBeginWeek, "тыс.руб.", "")
      ' Переменная, что процедуру setК_порInЕСУП вызывали
      call_setК_порInЕСУП = True
      ' --- Заносим в ЕСУП ---
    End If
        
    ' --- Заносим факт исполнения ЕСУП
    If НеделяНаЛистеN("ЕСУП") = WeekNumber(максимальная_Дата_выдачи_кредита) Then
      Call currentК_порInЕСУП(ThisWorkbook.Name, "ЕСУП", "ВПК4", максимальная_Дата_выдачи_кредита, ThisWorkbook.Sheets("Лист3").Cells(41, 8).Value, "тыс.руб.")
      ' Переменная, что процедуру currentК_порInЕСУП вызывали
      call_currentК_порInЕСУП = True
    End If
    ' --- Конец Заносим факт исполнения ЕСУП
            
    ' Данные по ОО ТаркоСале
    ' ПК Факт на ...
    ThisWorkbook.Sheets("Лист3").Cells(10, 3).Value = Round(ТаркоСале_ПК_Факт_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(10, 17).Value = ТаркоСале_ПК_Факт_шт
    
    ThisWorkbook.Sheets("Лист3").Cells(42, 3).Value = Round(ТаркоСале_ПК_Факт_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(74, 3).Value = Round(ТаркоСале_ПК_Факт_руб / 1000, 0)
        
    ' ПК Факт месяц
    ThisWorkbook.Sheets("Лист3").Cells(10, 6).Value = Round(ТаркоСале_ПК_Выдачи_Месяц_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(42, 6).Value = Round(ТаркоСале_ПК_Выдачи_Месяц_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(74, 8).Value = Round(ТаркоСале_ПК_Выдачи_Месяц_руб / 1000, 0)
    ' На лист факт Плана: Месяц (1-12), офис 1-5
    Call setResultValue(Month(максимальная_Дата_выдачи_кредита), 5, Round(ТаркоСале_ПК_Выдачи_Месяц_руб / 1000, 0))
    
    ' ПК Факт дата
    ThisWorkbook.Sheets("Лист3").Cells(10, 9).Value = Round(ТаркоСале_ПК_Выдачи_Дата_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(10, 10).Value = ТаркоСале_ПК_Выдачи_Дата_шт
    ThisWorkbook.Sheets("Лист3").Cells(42, 9).Value = Round(ТаркоСале_ПК_Выдачи_Дата_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(42, 10).Value = ТаркоСале_ПК_Выдачи_Дата_шт
    ThisWorkbook.Sheets("Лист3").Cells(74, 11).Value = Round(ТаркоСале_ПК_Выдачи_Дата_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(74, 12).Value = ТаркоСале_ПК_Выдачи_Дата_шт
    
    ' План на неделю - 6 дней
    ' ThisWorkbook.Sheets("Лист3").Cells(42, 7).Value = Round(ПланНаНеделю(ThisWorkbook.Sheets("Лист3").Cells(42, 5).Value, ThisWorkbook.Sheets("Лист3").Cells(42, 6).Value - ThisWorkbook.Sheets("Лист3").Cells(42, 8).Value, максимальная_Дата_выдачи_кредита, 6), 0)
    ' План на неделю - 5 дней
    ThisWorkbook.Sheets("Лист3").Cells(42, 7).Value = Round(ПланНаНеделю(ThisWorkbook.Sheets("Лист3").Cells(42, 5).Value, ThisWorkbook.Sheets("Лист3").Cells(42, 6).Value - ThisWorkbook.Sheets("Лист3").Cells(42, 8).Value, максимальная_Дата_выдачи_кредита, 5), 0)
    ThisWorkbook.Sheets("Лист3").Cells(74, 9).Value = Round(ПланНаНеделю(ThisWorkbook.Sheets("Лист3").Cells(42, 5).Value, ThisWorkbook.Sheets("Лист3").Cells(42, 6).Value - ThisWorkbook.Sheets("Лист3").Cells(42, 8).Value, максимальная_Дата_выдачи_кредита, 5), 0)
    
    ' ПК Факт неделя
    ThisWorkbook.Sheets("Лист3").Cells(42, 8).Value = Round(ТаркоСале_ПК_Выдачи_Неделя_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(74, 10).Value = Round(ТаркоСале_ПК_Выдачи_Неделя_руб / 1000, 0)
    
    ' ПК Факт Квартал
    ThisWorkbook.Sheets("Лист3").Cells(74, 6).Value = Round(ТаркоСале_ПК_Выдачи_Квартал_руб / 1000, 0)
        
    ' Вывод в таблицу Программы кредитования (из-за ошибки error procedure too large)
    Call writeInfoToTable(99, ТаркоСале_ПК_Выдачи_Месяц_руб_PA, _
                                ТаркоСале_ПК_Выдачи_Месяц_руб_ОПК, _
                                  ТаркоСале_ПК_Выдачи_Месяц_руб_Спецкомпании, _
                                    ТаркоСале_ПК_Выдачи_Месяц_руб_Госслужащие, _
                                      ТаркоСале_ПК_Выдачи_Месяц_руб_Зеленые, _
                                        ТаркоСале_ПК_Выдачи_Месяц_руб_Зарплатный_продукт, _
                                          ТаркоСале_ПК_Выдачи_Месяц_руб_Особые_отношения, _
                                            ТаркоСале_ПК_Выдачи_Месяц_руб_Проверено_временем, _
                                              ТаркоСале_ПК_Выдачи_Месяц_руб_Открытый_рынок, _
                                                ТаркоСале_ПК_Выдачи_Месяц_руб_Турбо_деньги, _
                                                  ТаркоСале_ПК_Выдачи_Месяц_руб_Прочие_программы)
               
    ' Вывод в таблицу Программы кредитования (из-за ошибки error procedure too large) в штуках
    Call writeInfoToTable2(99, ТаркоСале_ПК_Выдачи_Месяц_шт_PA)
               
               
    ' Заносим в ЕСУП (для ОО Тарко-Сале номер строки в ЕСУП = 11 и строка 42 на Листе 3)
    If НеделяНаЛистеN("ЕСУП") = WeekNumber(максимальная_Дата_выдачи_кредита) Then
      ' План ПК неделя
      ThisWorkbook.Sheets("ЕСУП").Cells(11, 3).Value = ThisWorkbook.Sheets("Лист3").Cells(42, 7).Value
      ' Факт ПК неделя
      ThisWorkbook.Sheets("ЕСУП").Cells(11, 4).Value = ThisWorkbook.Sheets("Лист3").Cells(42, 8).Value
      ' Поручение офису ВПК5 - для ОО Тарко-Сале
      Call setК_порInЕСУП(ThisWorkbook.Name, "ЕСУП", "ВПК5", ThisWorkbook.Sheets("Лист3").Cells(42, 7).Value, dateBeginWeek, "тыс.руб.", "")
      ' Переменная, что процедуру setК_порInЕСУП вызывали
      call_setК_порInЕСУП = True
    End If
    ' --- Заносим в ЕСУП ---
        
    ' --- Заносим факт исполнения ЕСУП
    If НеделяНаЛистеN("ЕСУП") = WeekNumber(максимальная_Дата_выдачи_кредита) Then
      Call currentК_порInЕСУП(ThisWorkbook.Name, "ЕСУП", "ВПК5", максимальная_Дата_выдачи_кредита, ThisWorkbook.Sheets("Лист3").Cells(42, 8).Value, "тыс.руб.")
      ' Переменная, что процедуру currentК_порInЕСУП вызывали
      call_currentК_порInЕСУП = True
    End If
    ' --- Конец Заносим факт исполнения ЕСУП

    ' Данные по ИЦ
    Call generateTextInTotal(максимальная_Дата_выдачи_кредита, ИЦ_Факт_руб, ИЦ_Факт_шт, ИЦ_Выдачи_Месяц_руб, ИЦ_Выдачи_Месяц_шт, ИЦ_Выдачи_Дата_руб, ИЦ_Выдачи_Дата_шт, ИЦ_Выдачи_Неделя_руб, ИЦ_Выдачи_Неделя_шт, ИЦ_Выдачи_Квартал_руб, ИЦ_Выдачи_Квартал_шт, ИЦ_628400_Факт_руб, ИЦ_628400_Факт_шт, ИЦ_628400_Выдачи_Месяц_руб, ИЦ_628400_Выдачи_Месяц_шт, ИЦ_628400_Выдачи_Дата_руб, ИЦ_628400_Выдачи_Дата_шт, ИЦ_628400_Выдачи_Неделя_руб, ИЦ_628400_Выдачи_Неделя_шт, ИЦ_628400_Выдачи_Квартал_руб, ИЦ_628400_Выдачи_Квартал_шт)

    ' ИК План на неделю - 6 дней
    ' ThisWorkbook.Sheets("Лист3").Cells(51, 7).Value = Round(ПланНаНеделю(ThisWorkbook.Sheets("Лист3").Cells(51, 5).Value, ThisWorkbook.Sheets("Лист3").Cells(51, 6).Value - ThisWorkbook.Sheets("Лист3").Cells(51, 8).Value, максимальная_Дата_выдачи_кредита, 6), 0)
    
    ' ИК План на неделю - 5 дней с учетом плана месяца
    ThisWorkbook.Sheets("Лист3").Cells(51, 7).Value = Round(ПланНаНеделю(ThisWorkbook.Sheets("Лист3").Cells(51, 5).Value, ThisWorkbook.Sheets("Лист3").Cells(51, 6).Value - ThisWorkbook.Sheets("Лист3").Cells(51, 8).Value, максимальная_Дата_выдачи_кредита, 5), 0)
    ' ThisWorkbook.Sheets("Лист3").Cells(83, 9).Value = Round(ПланНаНеделю(ThisWorkbook.Sheets("Лист3").Cells(51, 5).Value, ThisWorkbook.Sheets("Лист3").Cells(51, 6).Value - ThisWorkbook.Sheets("Лист3").Cells(51, 8).Value, максимальная_Дата_выдачи_кредита, 5), 0)
    
    ' ИК План на неделю - 5 дней с учетом плана квартала ПланНаНеделю_Q
    ThisWorkbook.Sheets("Лист3").Cells(83, 9).Value = Round(ПланНаНеделю_Q(ThisWorkbook.Sheets("Лист3").Cells(83, 5).Value, ThisWorkbook.Sheets("Лист3").Cells(83, 6).Value - ThisWorkbook.Sheets("Лист3").Cells(83, 10).Value, максимальная_Дата_выдачи_кредита, 5), 0)
    
    ' ИК Факт неделя
    ThisWorkbook.Sheets("Лист3").Cells(51, 8).Value = Round(ИЦ_Выдачи_Неделя_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(83, 10).Value = Round(ИЦ_Выдачи_Неделя_руб / 1000, 0)
            
    ' в т.ч. Сургут - План недели - 6 дней
    ' ThisWorkbook.Sheets("Лист3").Cells(52, 7).Value = Round(ПланНаНеделю(ThisWorkbook.Sheets("Лист3").Cells(52, 5).Value, ThisWorkbook.Sheets("Лист3").Cells(52, 6).Value - ThisWorkbook.Sheets("Лист3").Cells(52, 8).Value, максимальная_Дата_выдачи_кредита, 6), 0)
    ' в т.ч. Сургут - План недели - 5 дней
    ThisWorkbook.Sheets("Лист3").Cells(52, 7).Value = Round(ПланНаНеделю(ThisWorkbook.Sheets("Лист3").Cells(52, 5).Value, ThisWorkbook.Sheets("Лист3").Cells(52, 6).Value - ThisWorkbook.Sheets("Лист3").Cells(52, 8).Value, максимальная_Дата_выдачи_кредита, 5), 0)
    ThisWorkbook.Sheets("Лист3").Cells(84, 9).Value = Round(ПланНаНеделю(ThisWorkbook.Sheets("Лист3").Cells(52, 5).Value, ThisWorkbook.Sheets("Лист3").Cells(52, 6).Value - ThisWorkbook.Sheets("Лист3").Cells(52, 8).Value, максимальная_Дата_выдачи_кредита, 5), 0)
            
    ' в т.ч. Сургут - Факт недели
    ThisWorkbook.Sheets("Лист3").Cells(52, 8).Value = Round(ИЦ_628400_Выдачи_Неделя_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(84, 10).Value = Round(ИЦ_628400_Выдачи_Неделя_руб / 1000, 0)
            
    ' Заносим в ЕСУП (для ИЦ номер строки в ЕСУП = 18 и строка 51 на Листе 3)
    If НеделяНаЛистеN("ЕСУП") = WeekNumber(максимальная_Дата_выдачи_кредита) Then
      ' План ИК недели
      ThisWorkbook.Sheets("ЕСУП").Cells(18, 3).Value = ThisWorkbook.Sheets("Лист3").Cells(51, 7).Value
      ThisWorkbook.Sheets("ЕСУП").Cells(19, 3).Value = ThisWorkbook.Sheets("Лист3").Cells(52, 7).Value
      ' Поручение офису ВИК1 - для ИЦ Тюмени
      Call setК_порInЕСУП(ThisWorkbook.Name, "ЕСУП", "ВИК1", ThisWorkbook.Sheets("Лист3").Cells(51, 7).Value, dateBeginWeek, "тыс.руб.", "")
      Call setК_порInЕСУП(ThisWorkbook.Name, "ЕСУП", "ВИК2", ThisWorkbook.Sheets("Лист3").Cells(52, 7).Value, dateBeginWeek, "тыс.руб.", "")
      ' Переменная, что процедуру setК_порInЕСУП вызывали
      call_setК_порInЕСУП = True
    End If
    ' --- Заносим в ЕСУП ---
        
    ' Факт ИК недели
    If НеделяНаЛистеN("ЕСУП") = WeekNumber(максимальная_Дата_выдачи_кредита) Then
      ThisWorkbook.Sheets("ЕСУП").Cells(18, 4).Value = ThisWorkbook.Sheets("Лист3").Cells(51, 8).Value
      ThisWorkbook.Sheets("ЕСУП").Cells(19, 4).Value = ThisWorkbook.Sheets("Лист3").Cells(52, 8).Value
      ' --- Заносим факт исполнения ЕСУП
      Call currentК_порInЕСУП(ThisWorkbook.Name, "ЕСУП", "ВИК1", максимальная_Дата_выдачи_кредита, ThisWorkbook.Sheets("Лист3").Cells(51, 8).Value, "тыс.руб.")
      Call currentК_порInЕСУП(ThisWorkbook.Name, "ЕСУП", "ВИК2", максимальная_Дата_выдачи_кредита, ThisWorkbook.Sheets("Лист3").Cells(52, 8).Value, "тыс.руб.")
      ' Переменная, что процедуру currentК_порInЕСУП вызывали
      call_currentК_порInЕСУП = True
    End If
    ' --- Конец Заносим факт исполнения ЕСУП

    ' Внимание! Планов в рублях и штуках пока нет - переменные обнуляем и записываем нули в BASE\Indicators
    Issuing_month_625000_plan = ThisWorkbook.Sheets("Лист3").Cells(6, 5).Value * 1000
    Issuing_month_625000_plan_unit = 0
    Issuing_month_628400_plan = ThisWorkbook.Sheets("Лист3").Cells(7, 5).Value * 1000
    Issuing_month_628400_plan_unit = 0
    Issuing_month_628600_plan = ThisWorkbook.Sheets("Лист3").Cells(8, 5).Value * 1000
    Issuing_month_628600_plan_unit = 0
    Issuing_month_629300_plan = ThisWorkbook.Sheets("Лист3").Cells(9, 5).Value * 1000
    Issuing_month_629300_plan_unit = 0
    Issuing_month_629850_plan = ThisWorkbook.Sheets("Лист3").Cells(10, 5).Value * 1000
    Issuing_month_629850_plan_unit = 0
    Issuing_month_plan = (ThisWorkbook.Sheets("Лист3").Cells(6, 5).Value * 1000) + (ThisWorkbook.Sheets("Лист3").Cells(7, 5).Value * 1000) + (ThisWorkbook.Sheets("Лист3").Cells(8, 5).Value * 1000) + (ThisWorkbook.Sheets("Лист3").Cells(9, 5).Value * 1000) + (ThisWorkbook.Sheets("Лист3").Cells(10, 5).Value * 1000)
    Issuing_month_plan_unit = 0
    Issuing_mortage_month_plan = (ThisWorkbook.Sheets("Лист3").Cells(19, 5).Value * 1000)
    Issuing_mortage_month_plan_unit = 0
    
    ' Записываем рассчитанные показатели в BASE\Indicators.xlsx
    Application.StatusBar = "Установка Indicators ..."
    Call Write_to_table_Indicators(максимальная_Дата_выдачи_кредита, _
                                     Тюменский_ПК_Факт_руб + Сургутский_ПК_Факт_руб + Нижневартовский_ПК_Факт_руб + Новоуренгойский_ПК_Факт_руб + ТаркоСале_ПК_Факт_руб, Тюменский_ПК_Факт_шт + Сургутский_ПК_Факт_шт + _
                                       Нижневартовский_ПК_Факт_шт + Новоуренгойский_ПК_Факт_шт + ТаркоСале_ПК_Факт_шт, ИЦ_Факт_руб, ИЦ_Факт_шт, Тюменский_ПК_Факт_руб, Тюменский_ПК_Факт_шт, Сургутский_ПК_Факт_руб, _
                                         Сургутский_ПК_Факт_шт, Нижневартовский_ПК_Факт_руб, Нижневартовский_ПК_Факт_шт, Новоуренгойский_ПК_Факт_руб, Новоуренгойский_ПК_Факт_шт, ТаркоСале_ПК_Факт_руб, ТаркоСале_ПК_Факт_шт, _
                                           Issuing_month_625000_plan, Issuing_month_625000_plan_unit, _
                                             Тюменский_ПК_Выдачи_Месяц_руб, Тюменский_ПК_Выдачи_Месяц_шт, _
                                               Issuing_month_628400_plan, Issuing_month_628400_plan_unit, _
                                                 Сургутский_ПК_Выдачи_Месяц_руб, Сургутский_ПК_Выдачи_Месяц_шт, _
                                                   Issuing_month_628600_plan, Issuing_month_628600_plan_unit, _
                                                     Нижневартовский_ПК_Выдачи_Месяц_руб, Нижневартовский_ПК_Выдачи_Месяц_шт, _
                                                       Issuing_month_629300_plan, Issuing_month_629300_plan_unit, _
                                                         Новоуренгойский_ПК_Выдачи_Месяц_руб, Новоуренгойский_ПК_Выдачи_Месяц_шт, _
                                                           Issuing_month_629850_plan, Issuing_month_629850_plan_unit, _
                                                             ТаркоСале_ПК_Выдачи_Месяц_руб, ТаркоСале_ПК_Выдачи_Месяц_шт, _
                                                               Issuing_month_plan, Issuing_month_plan_unit, _
                                                                 Тюменский_ПК_Выдачи_Месяц_руб + Сургутский_ПК_Выдачи_Месяц_руб + Нижневартовский_ПК_Выдачи_Месяц_руб + Новоуренгойский_ПК_Выдачи_Месяц_руб + ТаркоСале_ПК_Выдачи_Месяц_руб, Тюменский_ПК_Выдачи_Месяц_шт + Сургутский_ПК_Выдачи_Месяц_шт + Нижневартовский_ПК_Выдачи_Месяц_шт + Новоуренгойский_ПК_Выдачи_Месяц_шт + ТаркоСале_ПК_Выдачи_Месяц_шт, _
                                                                   Issuing_mortage_month_plan, Issuing_mortage_month_plan_unit, _
                                                                     ИЦ_Выдачи_Месяц_руб, ИЦ_Выдачи_Месяц_шт, _
                                                                       Тюменский_ПК_Выдачи_Дата_руб, Тюменский_ПК_Выдачи_Дата_шт, _
                                                                         Сургутский_ПК_Выдачи_Дата_руб, Сургутский_ПК_Выдачи_Дата_шт, _
                                                                           Нижневартовский_ПК_Выдачи_Дата_руб, Нижневартовский_ПК_Выдачи_Дата_шт, _
                                                                             Новоуренгойский_ПК_Выдачи_Дата_руб, Новоуренгойский_ПК_Выдачи_Дата_шт, _
                                                                               ТаркоСале_ПК_Выдачи_Дата_руб, ТаркоСале_ПК_Выдачи_Дата_шт, _
                                                                                 ИЦ_Выдачи_Дата_руб, ИЦ_Выдачи_Дата_шт _
                                                                                   )
    
    ' 4. Делаем расчеты приростов и изменений
    ' Берем данные из BASE\Indicators в строке RowCount_начальная_Дата_года_из_Indicators
    ' Кредитный портфель, тыс. руб. ОО «Тюменский». Прирост с 01.01
    Прирост_Тюмень = ThisWorkbook.Sheets("Лист3").Cells(6, 3).Value - Round(Workbooks("Indicators").Sheets("Лист1").Cells(RowCount_начальная_Дата_года_из_Indicators, ColumnByName("Indicators", "Лист1", 1, "Loan_portfolio_625000")).Value / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(6, 4).Value = Прирост_Тюмень
    ThisWorkbook.Sheets("Лист3").Cells(38, 4).Value = Прирост_Тюмень
    ThisWorkbook.Sheets("Лист3").Cells(70, 4).Value = Прирост_Тюмень
    ' Если прирост <0, то окрашиваем в красный
    If Прирост_Тюмень < 0 Then
      ThisWorkbook.Sheets("Лист3").Cells(6, 4).Interior.Color = vbRed
      ThisWorkbook.Sheets("Лист3").Cells(38, 4).Interior.Color = vbRed
      ThisWorkbook.Sheets("Лист3").Cells(70, 4).Interior.Color = vbRed
    End If
    
    ' Кредитный портфель, тыс. руб. ОО «Сургутский». Прирост с 01.01
    Прирост_Сургут = ThisWorkbook.Sheets("Лист3").Cells(7, 3).Value - Round(Workbooks("Indicators").Sheets("Лист1").Cells(RowCount_начальная_Дата_года_из_Indicators, ColumnByName("Indicators", "Лист1", 1, "Loan_portfolio_628400")).Value / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(7, 4).Value = Прирост_Сургут
    ThisWorkbook.Sheets("Лист3").Cells(39, 4).Value = Прирост_Сургут
    ThisWorkbook.Sheets("Лист3").Cells(71, 4).Value = Прирост_Сургут
    ' Если прирост <0, то окрашиваем в красный
    If Прирост_Сургут < 0 Then
      ThisWorkbook.Sheets("Лист3").Cells(7, 4).Interior.Color = vbRed
      ThisWorkbook.Sheets("Лист3").Cells(39, 4).Interior.Color = vbRed
      ThisWorkbook.Sheets("Лист3").Cells(71, 4).Interior.Color = vbRed
    End If
    
    ' Кредитный портфель, тыс. руб. ОО «Нижневартовский». Прирост с 01.01
    Прирост_Нижневартовск = ThisWorkbook.Sheets("Лист3").Cells(8, 3).Value - Round(Workbooks("Indicators").Sheets("Лист1").Cells(RowCount_начальная_Дата_года_из_Indicators, ColumnByName("Indicators", "Лист1", 1, "Loan_portfolio_628600")).Value / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(8, 4).Value = Прирост_Нижневартовск
    ThisWorkbook.Sheets("Лист3").Cells(40, 4).Value = Прирост_Нижневартовск
    ThisWorkbook.Sheets("Лист3").Cells(72, 4).Value = Прирост_Нижневартовск
    ' Если прирост <0, то окрашиваем в красный
    If Прирост_Нижневартовск < 0 Then
      ThisWorkbook.Sheets("Лист3").Cells(8, 4).Interior.Color = vbRed
      ThisWorkbook.Sheets("Лист3").Cells(40, 4).Interior.Color = vbRed
      ThisWorkbook.Sheets("Лист3").Cells(72, 4).Interior.Color = vbRed
    End If
    
    ' Кредитный портфель, тыс. руб. ОО «Новоуренгойский». Прирост с 01.01
    Прирост_Новый_Уренгой = ThisWorkbook.Sheets("Лист3").Cells(9, 3).Value - Round(Workbooks("Indicators").Sheets("Лист1").Cells(RowCount_начальная_Дата_года_из_Indicators, ColumnByName("Indicators", "Лист1", 1, "Loan_portfolio_629300")).Value / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(9, 4).Value = Прирост_Новый_Уренгой
    ThisWorkbook.Sheets("Лист3").Cells(41, 4).Value = Прирост_Новый_Уренгой
    ThisWorkbook.Sheets("Лист3").Cells(73, 4).Value = Прирост_Новый_Уренгой
    ' Если прирост <0, то окрашиваем в красный
    If Прирост_Новый_Уренгой < 0 Then
      ThisWorkbook.Sheets("Лист3").Cells(9, 4).Interior.Color = vbRed
      ThisWorkbook.Sheets("Лист3").Cells(41, 4).Interior.Color = vbRed
      ThisWorkbook.Sheets("Лист3").Cells(73, 4).Interior.Color = vbRed
    End If
    
    ' Кредитный портфель, тыс. руб. ОО «Тарко-Сале». Прирост с 01.01
    Прирост_Тарко_Сале = ThisWorkbook.Sheets("Лист3").Cells(10, 3).Value - Round(Workbooks("Indicators").Sheets("Лист1").Cells(RowCount_начальная_Дата_года_из_Indicators, ColumnByName("Indicators", "Лист1", 1, "Loan_portfolio_629850")).Value / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(10, 4).Value = Прирост_Тарко_Сале
    ThisWorkbook.Sheets("Лист3").Cells(42, 4).Value = Прирост_Тарко_Сале
    ThisWorkbook.Sheets("Лист3").Cells(74, 4).Value = Прирост_Тарко_Сале
    ' Если прирост <0, то окрашиваем в красный
    If Прирост_Тарко_Сале < 0 Then
      ThisWorkbook.Sheets("Лист3").Cells(10, 4).Interior.Color = vbRed
      ThisWorkbook.Sheets("Лист3").Cells(42, 4).Interior.Color = vbRed
      ThisWorkbook.Sheets("Лист3").Cells(74, 4).Interior.Color = vbRed
    End If
        
    ' Кредитный портфель Ипотека, тыс. руб. ИЦ. Прирост с 01.01
    Прирост_Ипотека = ThisWorkbook.Sheets("Лист3").Cells(19, 3).Value - Round(Workbooks("Indicators").Sheets("Лист1").Cells(RowCount_начальная_Дата_года_из_Indicators, ColumnByName("Indicators", "Лист1", 1, "Loan_portfolio_mortgage")).Value / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(19, 4).Value = Прирост_Ипотека
    ThisWorkbook.Sheets("Лист3").Cells(51, 4).Value = Прирост_Ипотека
    ThisWorkbook.Sheets("Лист3").Cells(83, 4).Value = Прирост_Ипотека
    ' Если прирост <0, то окрашиваем в красный
    If Прирост_Ипотека < 0 Then
      ThisWorkbook.Sheets("Лист3").Cells(19, 4).Interior.Color = vbRed
      ThisWorkbook.Sheets("Лист3").Cells(51, 4).Interior.Color = vbRed
      ThisWorkbook.Sheets("Лист3").Cells(83, 4).Interior.Color = vbRed
    End If
         
         
    ' Берем данные из BASE\Indicators в строке RowCount_начальная_Дата_месяца_из_Indicators
    
    ' Берем данные из BASE\Indicators в строке RowCount_предидущая_Дата_из_Indicators
    ' Выдачи месяца, тыс. руб. ОО «Тюменский». Изм с пред. дата
    ThisWorkbook.Sheets("Лист3").Cells(6, 7).Value = Прирост_в_процентах(Round(Workbooks("Indicators").Sheets("Лист1").Cells(RowCount_предидущая_Дата_из_Indicators, ColumnByName("Indicators", "Лист1", 1, "Issuing_month_625000")).Value / 1000, 0), Round(Тюменский_ПК_Выдачи_Месяц_руб / 1000, 0))
    ' Выдачи месяца, тыс. руб. ОО «Сургутский». Изм с пред. дата
    ThisWorkbook.Sheets("Лист3").Cells(7, 7).Value = Прирост_в_процентах(Round(Workbooks("Indicators").Sheets("Лист1").Cells(RowCount_предидущая_Дата_из_Indicators, ColumnByName("Indicators", "Лист1", 1, "Issuing_month_628400")).Value / 1000, 0), Round(Сургутский_ПК_Выдачи_Месяц_руб / 1000, 0))
    ' Выдачи месяца, тыс. руб. ОО «Нижневартовский». Изм с пред. дата
    ThisWorkbook.Sheets("Лист3").Cells(8, 7).Value = Прирост_в_процентах(Round(Workbooks("Indicators").Sheets("Лист1").Cells(RowCount_предидущая_Дата_из_Indicators, ColumnByName("Indicators", "Лист1", 1, "Issuing_month_628600")).Value / 1000, 0), Round(Нижневартовский_ПК_Выдачи_Месяц_руб / 1000, 0))
    ' Выдачи месяца, тыс. руб. ОО «Новоуренгойский». Изм с пред. дата
    ThisWorkbook.Sheets("Лист3").Cells(9, 7).Value = Прирост_в_процентах(Round(Workbooks("Indicators").Sheets("Лист1").Cells(RowCount_предидущая_Дата_из_Indicators, ColumnByName("Indicators", "Лист1", 1, "Issuing_month_629300")).Value / 1000, 0), Round(Новоуренгойский_ПК_Выдачи_Месяц_руб / 1000, 0))
    ' Выдачи месяца, тыс. руб. ОО «Тарко-Сале». Изм с пред. дата
    ThisWorkbook.Sheets("Лист3").Cells(10, 7).Value = Прирост_в_процентах(Round(Workbooks("Indicators").Sheets("Лист1").Cells(RowCount_предидущая_Дата_из_Indicators, ColumnByName("Indicators", "Лист1", 1, "Issuing_month_629850")).Value / 1000, 0), Round(ТаркоСале_ПК_Выдачи_Месяц_руб / 1000, 0))
    ' Выдачи месяца, тыс. руб. Ипотека, тыс. руб. ИЦ. Изм с пред. дата
    ThisWorkbook.Sheets("Лист3").Cells(19, 7).Value = Прирост_в_процентах(Round(Workbooks("Indicators").Sheets("Лист1").Cells(RowCount_предидущая_Дата_из_Indicators, ColumnByName("Indicators", "Лист1", 1, "Issuing_mortage_month")).Value / 1000, 0), Round(ИЦ_Выдачи_Месяц_руб / 1000, 0))
    
    ' Установка в BASE\Tasks Полей: Status_persent, Status, Description_status для Last_Date
    If (call_setК_порInЕСУП = True) Or (call_currentК_порInЕСУП = True) Then
      '
      Application.StatusBar = "Установка Tasks для ВПК..."
      Call setStatusInTasks("Tasks", "Лист1", максимальная_Дата_выдачи_кредита, "ВПК", "") ' для In_К_пор = "ВПК", In_К_пор = "ВИК"
      '
      Application.StatusBar = "Установка Tasks для ВИК..."
      Call setStatusInTasks("Tasks", "Лист1", максимальная_Дата_выдачи_кредита, "ВИК", "") ' для In_К_пор = "ВПК", In_К_пор = "ВИК"
    End If
    
    ' Формируем список для отправки (в "Список получателей:"):
    ThisWorkbook.Sheets("Лист3").Cells(rowByValue(ThisWorkbook.Name, "Лист3", "Список получателей:", 100, 100), ColumnByValue(ThisWorkbook.Name, "Лист3", "Список получателей:", 100, 100) + 2).Value = getFromAddrBook("УДО2,УДО3,УДО4,УДО5,НОРПиКО1,НОРПиКО2,НОРПиКО3,НОРПиКО4,НОРПиКО5,ПМ,МРК1,МРК2,МРК3,МРК4,МРК5,НОКП,РРКК,МПП,РИЦ,РРИЦ,СотрИЦ", 2)

    ' Выводим штуки по ИЦ - квартал, месяц
    ' Месяц U83
    ThisWorkbook.Sheets("Лист3").Range("U83").Value = ИЦ_Выдачи_Месяц_шт
    ' Квартал S83
    ThisWorkbook.Sheets("Лист3").Range("S83").Value = ИЦ_Выдачи_Квартал_шт
    ' Неделя
    ' ИЦ_Выдачи_Неделя_шт
    ' Дата
    ' ИЦ_Выдачи_Дата_шт
    
    Application.StatusBar = "ИЦ: Расчет прогноза..."
    
    Call Расчет_прогноза_ИЦ

    Application.StatusBar = "Завершение ..."
    
    ' Закрываем файл с отчетом без сохранения изменений (параметр SaveChanges:=False)
    ' Workbooks(Dir(FileName)).Close SaveChanges:=False
    
    ' Закрываем базу BASE\Indicators.xlsx
    ' Workbooks("Indicators").Close SaveChanges:=True
    CloseBook ("Indicators")
        
    ' Закрываем базу BASE\Tasks
    CloseBook ("Tasks")
      
    ' В Q3 заносим имя файла отчета с полным путем
    ThisWorkbook.Sheets("Лист3").Range("Q3").Value = FileName
      
    ' Переходим в ячейку M2
    ThisWorkbook.Sheets("Лист3").Activate
    ThisWorkbook.Sheets("Лист3").Cells(2, 13).Select

    ' Копия таблицы по Ипотеке в файл для отправки
    Call Copy_Активы_Ипотека

    ' Отправка сообщения по Ипотеке
    Call Отправка_Lotus_Notes_Лист3_Активы_Ипотека

    ' Строка статуса
    Application.StatusBar = ""

    ' Зачеркиваем пункт меню на стартовой страницы - Call ЗачеркиваемТекстВячейке("Лист0", "D8")
    
    ' Проверить зачеркивание в зависимости от активности
    If (ThisWorkbook.Sheets("Лист0").Cells(rowByValue(ThisWorkbook.Name, "Лист0", "Регламентная карта:", 100, 100), ColumnByValue(ThisWorkbook.Name, "Лист0", "Регламентная карта:", 100, 100) + 4).Value = "(понедельник)") Or (CStr(ThisWorkbook.Sheets("Лист0").Cells(rowByValue(ThisWorkbook.Name, "Лист0", "Первый день недели:", 100, 100), ColumnByValue(ThisWorkbook.Name, "Лист0", "Первый день недели:", 100, 100) + 2).Value) = "1") Then
      ' Если был отчет за неделю "Оперативная справка по активам за неделю", т.е.: Лист0-F2 = "(понедельник)" или Лист0-L2 = "1"
      Call ЗачеркиваемТекстВячейке("Лист0", RangeByValue(ThisWorkbook.Name, "Лист0", "Оперативная справка по активам за неделю", 100, 100))
    Else
      ' Если был отчет за текущий день недели
      Call ЗачеркиваемТекстВячейке("Лист0", RangeByValue(ThisWorkbook.Name, "Лист0", "Оперативная справка по активам", 100, 100))
    End If
        
    ' Сначала переходим к началу, а затем на форму 2.2
    Call ПК_к_началу
    ' Переходим к Форме 2
    Call ПК_к_Форме2_2

    ' Сохранение изменений
    ThisWorkbook.Save

    ' Конец обработки
    finishProcess = True
    
    
    Else
            
      ' Если в выбранном отчете не верный формат или дата
      MsgBox ("Проверьте отчет: " + CheckFormatReportResult + "!")
    
    End If ' Проверка формы отчета

    ' Закрываем файл с отчетом без сохранения изменений (параметр SaveChanges:=False)
    Workbooks(Dir(FileName)).Close SaveChanges:=False

    ' Итоговое сообщение
    If finishProcess = True Then
      ' Call ПК_к_Форме2_2
      MsgBox ("Обработка " + DBstrName_String + " за " + CStr(максимальная_Дата_выдачи_кредита) + " завершена!")
    Else
      MsgBox ("Обработка отчета была прервана!")
    End If

  End If
  
End Sub

' Расчет прогноза ИЦ
Sub Расчет_прогноза_ИЦ()
    
    ' Делаем расчет прогноза между ДатаНачалаКвартала и ДатаКонцаКвартала
    Дата_отчета = periodFromSheet("Лист3")

    ' Ипотека - прогнозы месяца и квартала
    
    ' *** Месяц тыс.руб P83 ***
    
    ' Без учета нерабочих дней
    Прогноз_месяца_тыс_руб = Прогноз_месяца(Дата_отчета, ThisWorkbook.Sheets("Лист3").Range("G83").Value, ThisWorkbook.Sheets("Лист3").Range("H83").Value, 5, 0)
    
    ' С учетом нерабочих дней
    ' Прогноз_месяца_тыс_руб = Прогноз_месяца(Дата_отчета, ThisWorkbook.Sheets("Лист3").Range("G83").Value, ThisWorkbook.Sheets("Лист3").Range("H83").Value, 5, 1)
    
    ThisWorkbook.Sheets("Лист3").Range("P83").Value = РассчетДоли(ThisWorkbook.Sheets("Лист3").Range("G83").Value, Прогноз_месяца_тыс_руб, 3)
    
    ' Окраска ячейки СФЕТОФОР ' 70. Заливка ячейки цветом "светофор" - значение In_Value в %, In_Target в %
    Call Full_Color_RangeII("Лист3", 83, 16, ThisWorkbook.Sheets("Лист3").Range("P83").Value, 1)
    
    
    ' *** Квартал тыс.руб Q83 - Прогноз_квартала ***
    
    ' Без учета нерабочих дней
    Прогноз_квартала_тыс_руб = Прогноз_квартала(Дата_отчета, ThisWorkbook.Sheets("Лист3").Range("E83").Value, ThisWorkbook.Sheets("Лист3").Range("F83").Value, 5, 0)
    
    ' С учетом нерабочих дней
    ' Прогноз_квартала_тыс_руб = Прогноз_квартала(Дата_отчета, ThisWorkbook.Sheets("Лист3").Range("E83").Value, ThisWorkbook.Sheets("Лист3").Range("F83").Value, 5, 1)
    
    ThisWorkbook.Sheets("Лист3").Range("Q83").Value = РассчетДоли(ThisWorkbook.Sheets("Лист3").Range("E83").Value, Прогноз_квартала_тыс_руб, 3)

    ' Окраска ячейки СФЕТОФОР ' 70. Заливка ячейки цветом "светофор" - значение In_Value в %, In_Target в %
    Call Full_Color_RangeII("Лист3", 83, 17, ThisWorkbook.Sheets("Лист3").Range("Q83").Value, 1)


    ' *** Месяц шт X83 ***
    
    ' Без учета нерабочих дней
    Прогноз_месяца_шт = Прогноз_месяца(Дата_отчета, ThisWorkbook.Sheets("Лист3").Range("T83").Value, ThisWorkbook.Sheets("Лист3").Range("U83").Value, 5, 0)
    
    ' С учетом нерабочих дней
    ' Прогноз_месяца_шт = Прогноз_месяца(Дата_отчета, ThisWorkbook.Sheets("Лист3").Range("T83").Value, ThisWorkbook.Sheets("Лист3").Range("U83").Value, 5, 1)

    ThisWorkbook.Sheets("Лист3").Range("X83").Value = РассчетДоли(ThisWorkbook.Sheets("Лист3").Range("T83").Value, Прогноз_месяца_шт, 3)
   
    ' Окраска ячейки СФЕТОФОР ' 70. Заливка ячейки цветом "светофор" - значение In_Value в %, In_Target в %
    Call Full_Color_RangeII("Лист3", 83, 24, ThisWorkbook.Sheets("Лист3").Range("X83").Value, 1)
   
    ' *** Квартал шт Y83 ***
    ' Без учета нерабочих дней
    Прогноз_квартала_шт = Прогноз_квартала(Дата_отчета, ThisWorkbook.Sheets("Лист3").Range("R83").Value, ThisWorkbook.Sheets("Лист3").Range("S83").Value, 5, 0)
    
    ' С учетом нерабочих дней
    ' Прогноз_квартала_шт = Прогноз_квартала(Дата_отчета, ThisWorkbook.Sheets("Лист3").Range("R83").Value, ThisWorkbook.Sheets("Лист3").Range("S83").Value, 5, 1)
    
    ThisWorkbook.Sheets("Лист3").Range("Y83").Value = РассчетДоли(ThisWorkbook.Sheets("Лист3").Range("R83").Value, Прогноз_квартала_шт, 3)
    
    ' Окраска ячейки СФЕТОФОР ' 70. Заливка ячейки цветом "светофор" - значение In_Value в %, In_Target в %
    Call Full_Color_RangeII("Лист3", 83, 25, ThisWorkbook.Sheets("Лист3").Range("Y83").Value, 1)

     

End Sub

' Запись а Таблицу Indicators
Sub Write_to_table_Indicators(In_Date, In_Loan_portfolio, In_Loan_portfolio_unit, In_Loan_portfolio_mortgage, In_Loan_portfolio_mortgage_unit, In_Loan_portfolio_625000, In_Loan_portfolio_625000_unit, In_Loan_portfolio_628400, In_Loan_portfolio_628400_unit, In_Loan_portfolio_628600, In_Loan_portfolio_628600_unit, In_Loan_portfolio_629300, In_Loan_portfolio_629300_unit, In_Loan_portfolio_629850, In_Loan_portfolio_629850_unit, _
                                In_Issuing_month_625000_plan, In_Issuing_month_625000_plan_unit, In_Issuing_month_625000, In_Issuing_month_625000_unit, In_Issuing_month_628400_plan, In_Issuing_month_628400_plan_unit, In_Issuing_month_628400, In_Issuing_month_628400_unit, In_Issuing_month_628600_plan, In_Issuing_month_628600_plan_unit, In_Issuing_month_628600, In_Issuing_month_628600_unit, In_Issuing_month_629300_plan, In_Issuing_month_629300_plan_unit, In_Issuing_month_629300, In_Issuing_month_629300_unit, In_Issuing_month_629850_plan, In_Issuing_month_629850_plan_unit, In_Issuing_month_629850, In_Issuing_month_629850_unit, _
                                  In_Issuing_month_plan, In_Issuing_month_plan_unit, In_Issuing_month, In_Issuing_month_unit, In_Issuing_mortage_month_plan, In_Issuing_mortage_month_plan_unit, In_Issuing_mortage_month, In_Issuing_mortage_month_unit, _
                                    In_Issuing_date_625000, In_Issuing_date_625000_unit, In_Issuing_date_628400, In_Issuing_date_628400_unit, In_Issuing_date_628600, In_Issuing_date_628600_unit, In_Issuing_date_629300, In_Issuing_date_629300_unit, In_Issuing_date_629850, In_Issuing_date_629850_unit, In_Issuing_mortage_date, In_Issuing_mortage_date_unit)
    
    ' Находим строку с максимальная_Дата_выдачи_кредита
    Set Поиск_максимальная_Дата_выдачи_кредита = Workbooks("Indicators").Sheets("Лист1").Columns("A:A").Find(In_Date, LookAt:=xlWhole)
    
    ' Проверяем - есть ли такая дата, если нет, то добавляем
    If Поиск_максимальная_Дата_выдачи_кредита Is Nothing Then
      ' Находим свободную строку в таблице для записи - Начинаем со второй строки
      rowCount = 2
      ' Здесь идем по столбцу "Date"
      Do While (Workbooks("Indicators").Sheets("Лист1").Cells(rowCount, 1).Value <> "")
        ' Следующая запись
        DoEventsInterval (rowCount)
        rowCount = rowCount + 1
      Loop ' Обработка строк в цикле
      ' Записываем в первую пустую строку
      Строка_для_записи = rowCount
      ' Дата
      Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Date")) = In_Date
    Else
      ' Если найден, то записываем данные
      Строка_для_записи = Поиск_максимальная_Дата_выдачи_кредита.Row
    End If
  
  ' Запись
  ' Кредитный портфель ПК Loan_portfolio B-2
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Loan_portfolio")) = In_Loan_portfolio
  ' Unit
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Loan_portfolio_unit")) = In_Loan_portfolio_unit
  ' Loan_portfolio_mortgage
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Loan_portfolio_mortgage")) = In_Loan_portfolio_mortgage
  ' Unit
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Loan_portfolio_mortgage_unit")) = In_Loan_portfolio_mortgage_unit
  ' In_Loan_portfolio_625000,
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Loan_portfolio_625000")) = In_Loan_portfolio_625000
  ' In_Loan_portfolio_625000_unit,
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Loan_portfolio_625000_unit")) = In_Loan_portfolio_625000_unit
  ' In_Loan_portfolio_628400,
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Loan_portfolio_628400")) = In_Loan_portfolio_628400
  ' In_Loan_portfolio_628400_unit,
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Loan_portfolio_628400_unit")) = In_Loan_portfolio_628400_unit
  ' In_Loan_portfolio_628600,
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Loan_portfolio_628600")) = In_Loan_portfolio_628600
  ' In_Loan_portfolio_628600_unit,
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Loan_portfolio_628600_unit")) = In_Loan_portfolio_628600_unit
  ' In_Loan_portfolio_629300,
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Loan_portfolio_629300")) = In_Loan_portfolio_629300
  ' In_Loan_portfolio_629300_unit
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Loan_portfolio_629300_unit")) = In_Loan_portfolio_629300_unit
  ' In_Loan_portfolio_629850,
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Loan_portfolio_629850")) = In_Loan_portfolio_629850
  ' In_Loan_portfolio_629850_unit
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Loan_portfolio_629850_unit")) = In_Loan_portfolio_629850_unit
  
  ' Issuing_month: Issuing_month_625000_plan, Issuing_month_625000_plan_unit, Issuing_month_625000, Issuing_month_625000_unit, Issuing_month_628400_plan, Issuing_month_628400_plan_unit, Issuing_month_628400, Issuing_month_628400_unit, Issuing_month_628600_plan, Issuing_month_628600_plan_unit, Issuing_month_628600, Issuing_month_628600_unit, Issuing_month_629300_plan, Issuing_month_629300_plan_unit, Issuing_month_629300, Issuing_month_629300_unit, Issuing_month_629850_plan, Issuing_month_629850_plan_unit, Issuing_month_629850, Issuing_month_629850_unit
  ' Issuing_month_625000_plan
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Issuing_month_625000_plan")) = In_Issuing_month_625000_plan
  ' Issuing_month_625000_plan_unit
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Issuing_month_625000_plan_unit")) = In_Issuing_month_625000_plan_unit
  ' Issuing_month_625000
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Issuing_month_625000")) = In_Issuing_month_625000
  ' Issuing_month_625000_unit
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Issuing_month_625000_unit")) = In_Issuing_month_625000_unit
  ' Issuing_month_628400_plan
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Issuing_month_628400_plan")) = In_Issuing_month_628400_plan
  ' Issuing_month_628400_plan_unit
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Issuing_month_628400_plan_unit")) = In_Issuing_month_628400_plan_unit
  ' Issuing_month_628400
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Issuing_month_628400")) = In_Issuing_month_628400
  ' Issuing_month_628400_unit
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Issuing_month_628400_unit")) = In_Issuing_month_628400_unit
  ' Issuing_month_628600_plan
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Issuing_month_628600_plan")) = In_Issuing_month_628600_plan
  ' Issuing_month_628600_plan_unit
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Issuing_month_628600_plan_unit")) = In_Issuing_month_628600_plan_unit
  ' Issuing_month_628600
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Issuing_month_628600")) = In_Issuing_month_628600
  ' Issuing_month_628600_unit
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Issuing_month_628600_unit")) = In_Issuing_month_628600_unit
  ' Issuing_month_629300_plan
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Issuing_month_629300_plan")) = In_Issuing_month_629300_plan
  ' Issuing_month_629300_plan_unit
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Issuing_month_629300_plan_unit")) = In_Issuing_month_629300_plan_unit
  ' Issuing_month_629300
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Issuing_month_629300")) = In_Issuing_month_629300
  ' Issuing_month_629300_unit
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Issuing_month_629300_unit")) = In_Issuing_month_629300_unit
  ' Issuing_month_629850_plan
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Issuing_month_629850_plan")) = In_Issuing_month_629850_plan
  ' Issuing_month_629850_plan_unit
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Issuing_month_629850_plan_unit")) = In_Issuing_month_629850_plan_unit
  ' Issuing_month_629850
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Issuing_month_629850")) = In_Issuing_month_629850
  ' Issuing_month_629850_unit
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Issuing_month_629850_unit")) = In_Issuing_month_629850_unit

  ' Issuing_month_plan
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Issuing_month_plan")) = In_Issuing_month_plan
  ' Issuing_month_plan_unit
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Issuing_month_plan_unit")) = In_Issuing_month_plan_unit
  ' Issuing_month
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Issuing_month")) = In_Issuing_month
  ' Issuing_month_unit
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Issuing_month_unit")) = In_Issuing_month_unit
  ' Issuing_mortage_month_plan
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Issuing_mortage_month_plan")) = In_Issuing_mortage_month_plan
  ' Issuing_mortage_month_plan_unit
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Issuing_mortage_month_plan_unit")) = In_Issuing_mortage_month_plan_unit
  ' Issuing_mortage_month
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Issuing_mortage_month")) = In_Issuing_mortage_month
  ' Issuing_mortage_month_unit
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Issuing_mortage_month_unit")) = In_Issuing_mortage_month_unit
  
  ' Issuing_date_625000
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Issuing_date_625000")) = In_Issuing_date_625000
  ' Issuing_date_625000_unit
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Issuing_date_625000_unit")) = In_Issuing_date_625000_unit
  ' Issuing_date_628400
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Issuing_date_628400")) = In_Issuing_date_628400
  ' Issuing_date_628400_unit
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Issuing_date_628400_unit")) = In_Issuing_date_628400_unit
  ' Issuing_date_628600
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Issuing_date_628600")) = In_Issuing_date_628600
  ' Issuing_date_628600_unit
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Issuing_date_628600_unit")) = In_Issuing_date_628600_unit
  ' Issuing_date_629300
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Issuing_date_629300")) = In_Issuing_date_629300
  ' Issuing_date_629300_unit
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Issuing_date_629300_unit")) = In_Issuing_date_629300_unit
  ' Issuing_date_629850
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Issuing_date_629850")) = In_Issuing_date_629850
  ' Issuing_date_629850_unit
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Issuing_date_629850_unit")) = In_Issuing_date_629850_unit
  ' Issuing_mortage_date
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Issuing_mortage_date")) = In_Issuing_mortage_date
  ' Issuing_mortage_date_unit
  Workbooks("Indicators").Sheets("Лист1").Cells(Строка_для_записи, ColumnByName("Indicators", "Лист1", 1, "Issuing_mortage_date_unit")) = In_Issuing_mortage_date_unit

End Sub

' Кредитный портфель в аналитике для физ.лиц (по доп. офисам)
Sub Кредитный_портфель_ПЗ()

' Описание переменных
Dim ReportName_String, officeNameInReport, CheckFormatReportResult, Форма_3_Range_str As String
Dim i, rowCount As Integer
Dim портфельОфисаПК, размерПЗ_ПК, портфельОфисаИК, размерПЗ_ИК, type1, type2, type3, type4, type5, typeI1, typeI2, typeI3, typeI4, typeI5  As Double
Dim dateInReport As Date
Dim finishProcess As Boolean
Dim Форма_3_Range_Row, Форма_3_Range_Column As Byte
  
  ' Открыть файл с отчетом
  FileName = Application.GetOpenFilename("Excel Files (*.xml), *.xml", , "Открытие файла с отчетом")

  ' Если файл был выбран
  If (Len(FileName) > 5) Then
  
    ' Строка статуса
    Application.StatusBar = "Обработка отчета..."
    
    ' Переменная начала обработки
    finishProcess = False

    ' Выводим для инфо данные об имени файла
    ReportName_String = Dir(FileName)
  
    ' Открываем выбранную книгу (UpdateLinks:=0)
    Workbooks.Open FileName, 0
      
    ' Переходим на окно DB
    ThisWorkbook.Sheets("Лист3").Activate

    ' Проверка формы отчета
    CheckFormatReportResult = CheckFormatReport(ReportName_String, "КП в аналитике", 6, Date - 1)
    
    If CheckFormatReportResult = "OK" Then
        
      ' Дата отчета
      dateInReport = CDate(Workbooks(ReportName_String).Sheets("КП в аналитике").Range("C1").Value)
      
      ' Форма 3
      Форма_3_Range_str = RangeByValue(ThisWorkbook.Name, "Лист3", "Форма 3.1", 200, 200)
      Форма_3_Range_Row = Workbooks(ThisWorkbook.Name).Sheets("Лист3").Range(Форма_3_Range_str).Row
      Форма_3_Range_Column = Workbooks(ThisWorkbook.Name).Sheets("Лист3").Range(Форма_3_Range_str).Column

      ' Дату в Заголовки "Факт на 26.02"
      ' ThisWorkbook.Sheets("Лист3").Range("B72").Value = "Просроченная задолженность на " + CStr(dateInReport) + " г."
      ThisWorkbook.Sheets("Лист3").Cells(Форма_3_Range_Row - 1, Форма_3_Range_Column).Value = "Просроченная задолженность на " + CStr(dateInReport) + " г."
      
      ' ThisWorkbook.Sheets("Лист3").Range("C75").Value = "Факт на " + strDDMM(dateInReport)
      ThisWorkbook.Sheets("Лист3").Cells(Форма_3_Range_Row + 2, Форма_3_Range_Column + 1).Value = "Факт на " + strDDMM(dateInReport)
      
      ' ThisWorkbook.Sheets("Лист3").Range("F75").Value = "Факт на " + strDDMM(dateInReport)
      ThisWorkbook.Sheets("Лист3").Cells(Форма_3_Range_Row + 2, Форма_3_Range_Column + 4).Value = "Факт на " + strDDMM(dateInReport)
      
      ' ThisWorkbook.Sheets("Лист3").Range("I75").Value = "Факт на " + strDDMM(dateInReport)
      ThisWorkbook.Sheets("Лист3").Cells(Форма_3_Range_Row + 2, Форма_3_Range_Column + 7).Value = "Факт на " + strDDMM(dateInReport)
      
      ' ThisWorkbook.Sheets("Лист3").Range("C85").Value = "Факт на " + strDDMM(dateInReport)
      ThisWorkbook.Sheets("Лист3").Cells(Форма_3_Range_Row + 12, Форма_3_Range_Column + 1).Value = "Факт на " + strDDMM(dateInReport)
      
      ' ThisWorkbook.Sheets("Лист3").Range("C92").Value = "Кредитный портфель. Просроченная задолженность на " + strDDMM(dateInReport) + ",                                                                                                            тыс. руб."
      ThisWorkbook.Sheets("Лист3").Cells(Форма_3_Range_Row + 19, Форма_3_Range_Column + 1).Value = "Кредитный портфель. Просроченная задолженность на " + strDDMM(dateInReport) + ",                                                                                                            тыс. руб."
      
      ' ThisWorkbook.Sheets("Лист3").Range("C102").Value = "Кредитный портфель Ипотека. Просроченная задолженность на " + strDDMM(dateInReport) + ",                                                                                                            тыс. руб."
      ThisWorkbook.Sheets("Лист3").Cells(Форма_3_Range_Row + 29, Форма_3_Range_Column + 1).Value = "Кредитный портфель Ипотека. Просроченная задолженность на " + strDDMM(dateInReport) + ",                                                                                                            тыс. руб."
    
      ' Классификация ПЗ. В столбце BU - Дата, начиная с которой, просрочен кредит
      ' Первый тип – от 1 до 30 дней. Не интересует
      ' Второй тип (30+) – от 30 до 60 дней. Принимается во внимание
      ' Третий тип (60+) – от 60 до 90 дней.
      ' Четвертый тип (90+) – от 90 до 120 дней. О кредитовании речи быть не может
      ' Пятый тип (120+) – свыше 120 дней. О кредитовании вы можете забыть

      ' Обрабатываем отчет
      ' Цикл по 5-ти офисам
      ' Ипотека (по всем офисам)
      портфельИКОбщий = 0
      размерПЗпоИКОбщий = 0
      ' Тип просрочки в зависимости от срока просрочки
      typeI1 = 0
      typeI2 = 0
      typeI3 = 0
      typeI4 = 0
      typeI5 = 0
      ' Обработка отчета
      For i = 1 To 5
        ' Номера офисов от 1 до 5
        Select Case i
          Case 1 ' ОО «Тюменский»
            officeNameInReport = "Тюменский"
          Case 2 ' ОО «Сургутский»
            officeNameInReport = "Сургутский"
          Case 3 ' ОО «Нижневартовский»
            officeNameInReport = "Нижневартовский"
          Case 4 ' ОО «Новоуренгойский»
            officeNameInReport = "Новоуренгойский"
          Case 5 ' ОО «Тарко-Сале»
            officeNameInReport = "Тарко-Сале"
        End Select

        rowCount = 6
        ' Переменные
        портфельОфисаПК = 0
        размерПЗ_ПК = 0
        портфельОфисаИК = 0
        размерПЗ_ИК = 0
        ' ПЗ
        type1 = 0
        type2 = 0
        type3 = 0
        type4 = 0
        type5 = 0
      
        Do While Not IsEmpty(Workbooks(ReportName_String).Sheets("КП в аналитике").Cells(rowCount, 1).Value)
          ' Если это текущий офис
          If InStr(Workbooks(ReportName_String).Sheets("КП в аналитике").Cells(rowCount, 2).Value, officeNameInReport) <> 0 Then
          
            ' Если это ПК
            If Workbooks(ReportName_String).Sheets("КП в аналитике").Cells(rowCount, 6).Value = "Потребительский кредит" Then
            
              портфельОфисаПК = портфельОфисаПК + CDbl(Workbooks(ReportName_String).Sheets("КП в аналитике").Cells(rowCount, 17).Value)
              размерПЗ_ПК = размерПЗ_ПК + CDbl(Workbooks(ReportName_String).Sheets("КП в аналитике").Cells(rowCount, 19).Value)
            
              ' Считаем просрочку
              ' If CDbl(Workbooks(ReportName_String).Sheets("КП в аналитике").Cells(rowCount, 19).Value) <> 0 Then
              If (CDbl(Workbooks(ReportName_String).Sheets("КП в аналитике").Cells(rowCount, 19).Value) <> 0) And ((Workbooks(ReportName_String).Sheets("КП в аналитике").Cells(rowCount, 73).Value) <> "") Then
              
                Select Case DateDiff("d", CDate(Workbooks(ReportName_String).Sheets("КП в аналитике").Cells(rowCount, 73).Value), dateInReport)
                  Case 1 To 30 ' Первый тип – от 1 до 30 дней. Не интересует
                    type1 = type1 + CDbl(Workbooks(ReportName_String).Sheets("КП в аналитике").Cells(rowCount, 19).Value)
                  Case 31 To 60 ' Второй тип (30+) – от 30 до 60 дней. Принимается во внимание
                    type2 = type2 + CDbl(Workbooks(ReportName_String).Sheets("КП в аналитике").Cells(rowCount, 19).Value)
                  Case 61 To 90 ' Третий тип (60+) – от 60 до 90 дней.
                    type3 = type3 + CDbl(Workbooks(ReportName_String).Sheets("КП в аналитике").Cells(rowCount, 19).Value)
                  Case 91 To 120 ' Четвертый тип (90+) – от 90 до 120 дней. О кредитовании речи быть не может
                    type4 = type4 + CDbl(Workbooks(ReportName_String).Sheets("КП в аналитике").Cells(rowCount, 19).Value)
                  Case Is > 121 ' Пятый тип (120+) – свыше 120 дней. О кредитовании вы можете забыть
                    type5 = type5 + CDbl(Workbooks(ReportName_String).Sheets("КП в аналитике").Cells(rowCount, 19).Value)
                End Select
              End If
            End If
          
            ' Если это ИК
            If Workbooks(ReportName_String).Sheets("КП в аналитике").Cells(rowCount, 6).Value = "Ипотечный кредит" Then
              портфельОфисаИК = портфельОфисаИК + CDbl(Workbooks(ReportName_String).Sheets("КП в аналитике").Cells(rowCount, 17).Value)
              размерПЗ_ИК = размерПЗ_ИК + CDbl(Workbooks(ReportName_String).Sheets("КП в аналитике").Cells(rowCount, 19).Value)
              ' По всей ипотеке
              портфельИКОбщий = портфельИКОбщий + CDbl(Workbooks(ReportName_String).Sheets("КП в аналитике").Cells(rowCount, 17).Value)
              размерПЗпоИКОбщий = размерПЗпоИКОбщий + CDbl(Workbooks(ReportName_String).Sheets("КП в аналитике").Cells(rowCount, 19).Value)
            
              ' Считаем просрочку
              ' If CDbl(Workbooks(ReportName_String).Sheets("КП в аналитике").Cells(rowCount, 19).Value) <> 0 Then
              If (CDbl(Workbooks(ReportName_String).Sheets("КП в аналитике").Cells(rowCount, 19).Value) <> 0) And ((Workbooks(ReportName_String).Sheets("КП в аналитике").Cells(rowCount, 73).Value) <> "") Then
                
                
                Select Case DateDiff("d", CDate(Workbooks(ReportName_String).Sheets("КП в аналитике").Cells(rowCount, 73).Value), dateInReport)
                  Case 1 To 30 ' Первый тип – от 1 до 30 дней. Не интересует
                    typeI1 = typeI1 + CDbl(Workbooks(ReportName_String).Sheets("КП в аналитике").Cells(rowCount, 19).Value)
                  Case 31 To 60 ' Второй тип (30+) – от 30 до 60 дней. Принимается во внимание
                    typeI2 = typeI2 + CDbl(Workbooks(ReportName_String).Sheets("КП в аналитике").Cells(rowCount, 19).Value)
                  Case 61 To 90 ' Третий тип (60+) – от 60 до 90 дней.
                    typeI3 = typeI3 + CDbl(Workbooks(ReportName_String).Sheets("КП в аналитике").Cells(rowCount, 19).Value)
                  Case 91 To 120 ' Четвертый тип (90+) – от 90 до 120 дней. О кредитовании речи быть не может
                    typeI4 = typeI4 + CDbl(Workbooks(ReportName_String).Sheets("КП в аналитике").Cells(rowCount, 19).Value)
                  Case Is > 121 ' Пятый тип (120+) – свыше 120 дней. О кредитовании вы можете забыть
                    typeI5 = typeI5 + CDbl(Workbooks(ReportName_String).Sheets("КП в аналитике").Cells(rowCount, 19).Value)
                End Select
                
              End If
            
            End If
          
          End If
          
          ' Следующая запись
          rowCount = rowCount + 1
          Application.StatusBar = officeNameInReport + ": " + CStr(rowCount) + "..."
          DoEventsInterval (rowCount)
          
        Loop
   
        ' Выводим данные по офису
        ' 75 -> (Форма_3_Range_Row + 2)
        ThisWorkbook.Sheets("Лист3").Cells((Форма_3_Range_Row + 2) + i, 3).Value = Round(портфельОфисаПК / 1000, 0)
        ThisWorkbook.Sheets("Лист3").Cells((Форма_3_Range_Row + 2) + i, 4).Value = Round(размерПЗ_ПК / 1000, 0)
        
        ' если в офисе есть ИК
        ' 75
        ThisWorkbook.Sheets("Лист3").Cells((Форма_3_Range_Row + 2) + i, 6).Value = Round(портфельОфисаИК / 1000, 0)
        ThisWorkbook.Sheets("Лист3").Cells((Форма_3_Range_Row + 2) + i, 7).Value = Round(размерПЗ_ИК / 1000, 0)
        
        ' если Сургутский, то дублируем в Ипотечный центр
        ' 87 -> (Форма_3_Range_Row + 14)
        If officeNameInReport = "Сургутский" Then
          ThisWorkbook.Sheets("Лист3").Cells((Форма_3_Range_Row + 14), 3).Value = Round(портфельОфисаИК / 1000, 0)
          ThisWorkbook.Sheets("Лист3").Cells((Форма_3_Range_Row + 14), 4).Value = Round(размерПЗ_ИК / 1000, 0)
        End If
        
        ' По видам просрочки (5 типов)
        ' 93 -> (Форма_3_Range_Row + 20)
        ThisWorkbook.Sheets("Лист3").Cells((Форма_3_Range_Row + 20) + i, 3).Value = Round(type1 / 1000, 0)
        ThisWorkbook.Sheets("Лист3").Cells((Форма_3_Range_Row + 20) + i, 4).Value = Round(type2 / 1000, 0)
        ThisWorkbook.Sheets("Лист3").Cells((Форма_3_Range_Row + 20) + i, 5).Value = Round(type3 / 1000, 0)
        ThisWorkbook.Sheets("Лист3").Cells((Форма_3_Range_Row + 20) + i, 6).Value = Round(type4 / 1000, 0)
        ThisWorkbook.Sheets("Лист3").Cells((Форма_3_Range_Row + 20) + i, 7).Value = Round(type5 / 1000, 0)
      
      Next i ' Следующий офис

      ' Выводим данные по Ипотеке
      ' 86 -> (Форма_3_Range_Row + 13)
      ThisWorkbook.Sheets("Лист3").Cells((Форма_3_Range_Row + 13), 3).Value = Round(портфельИКОбщий / 1000, 0)
      ThisWorkbook.Sheets("Лист3").Cells((Форма_3_Range_Row + 13), 4).Value = Round(размерПЗпоИКОбщий / 1000, 0)
      ' 104 -> (Форма_3_Range_Row + 31)
      ThisWorkbook.Sheets("Лист3").Cells((Форма_3_Range_Row + 31), 3).Value = Round(typeI1 / 1000, 0)
      ThisWorkbook.Sheets("Лист3").Cells((Форма_3_Range_Row + 31), 4).Value = Round(typeI2 / 1000, 0)
      ThisWorkbook.Sheets("Лист3").Cells((Форма_3_Range_Row + 31), 5).Value = Round(typeI3 / 1000, 0)
      ThisWorkbook.Sheets("Лист3").Cells((Форма_3_Range_Row + 31), 6).Value = Round(typeI4 / 1000, 0)
      ThisWorkbook.Sheets("Лист3").Cells((Форма_3_Range_Row + 31), 7).Value = Round(typeI5 / 1000, 0)
      
      ' Конец обработки
      finishProcess = True
    
    Else
      ' Если в выбранном отчете не верный формат или дата
      MsgBox ("Проверьте отчет: " + CheckFormatReportResult + "!")
    End If ' Проверка формы отчета
   
    ' Закрываем файл с отчетом без сохранения изменений (параметр SaveChanges:=False)
    Workbooks(Dir(FileName)).Close SaveChanges:=False
    
    ' Переходим в ячейку M2
    ThisWorkbook.Sheets("Лист3").Range("L78").Select

    ' Строка статуса
    Application.StatusBar = ""
    
    ' Итоговое сообщение
    If finishProcess = True Then
      MsgBox ("Обработка " + Dir(ReportName_String) + " завершена!")
    Else
      MsgBox ("Обработка отчета была прервана!")
    End If
    
  End If ' Если файл был выбран

End Sub

' Отправка письма: отправляю шаблон самому себе для последующей отправки в сеть письма на его основе:
Sub Отправка_Lotus_Notes_Лист3_Активы()
Dim темаПисьма, текстПисьма, hashTag As String
Dim i As Byte
  
  If MsgBox("Отправить себе Шаблон письма?", vbYesNo) = vbYes Then
    
    ' Тема письма - Тема:
    темаПисьма = subjectFromSheet("Лист3")

    ' hashTag - Хэштэг:
    hashTag = hashTagFromSheet("Лист3")
    
    ' Текст письма
    текстПисьма = "" + Chr(13)
    текстПисьма = текстПисьма + "" + ThisWorkbook.Sheets("Лист3").Cells(rowByValue(ThisWorkbook.Name, "Лист3", "Список получателей:", 100, 100), ColumnByValue(ThisWorkbook.Name, "Лист3", "Список получателей:", 100, 100) + 2).Value + Chr(13)
    текстПисьма = текстПисьма + "" + Chr(13)
    текстПисьма = текстПисьма + "" + getFromAddrBook("РД", 2) + Chr(13)
    текстПисьма = текстПисьма + "" + Chr(13)
    текстПисьма = текстПисьма + "Уважаемые сотрудники," + Chr(13)
    текстПисьма = текстПисьма + "" + Chr(13)
    текстПисьма = текстПисьма + "Объем кредитного портфеля с изменениями за период." + Chr(13)
    текстПисьма = текстПисьма + "" + Chr(13)
    текстПисьма = текстПисьма + "" + Chr(13)
    ' Визитка (подпись С Ув., )
    текстПисьма = текстПисьма + ПодписьВПисьме()
    ' Хэштег
    текстПисьма = текстПисьма + createBlankStr(20) + hashTag
    ' Вызов
    Call send_Lotus_Notes2(темаПисьма, "Sergey Fedorovich Proschaev/Tyumen/PSBank/Ru", "Sergey Fedorovich Proschaev/Tyumen/PSBank/Ru", "", текстПисьма, "")
  
    ' Сообщение
    MsgBox ("Письмо отправлено!")
     
  End If
  
End Sub

' Переход к началу Листа на ПК
Sub ПК_к_началу()
  ThisWorkbook.Sheets("Лист3").Activate
  ThisWorkbook.Sheets("Лист3").Cells(3, 13).Select
End Sub

' Отправка письма: отправляю шаблон самому себе для последующей отправки в сеть письма на его основе:
Sub Отправка_Lotus_Notes_Лист3_Активы_Ипотека()
Dim темаПисьма, текстПисьма, hashTag, attachmentFile As String
Dim i As Byte
  
  If MsgBox("Отправить себе Шаблон письма по ИЦ?", vbYesNo) = vbYes Then
    
    ' Тема письма - Тема:
    темаПисьма = subjectFromSheet("Лист3") + " (Ипотека)"

    ' Файл-вложение (!!!)
    attachmentFile = ThisWorkbook.Sheets("Лист3").Range("U3").Value

    ' hashTag - Хэштэг:
    hashTag = hashTagFromSheet("Лист3") + " #ипотека #иц"
    
    ' Текст письма
    ' текстПисьма = "" + Chr(13)
    текстПисьма = текстПисьма + "" + getFromAddrBook("РИЦ,СотрИЦ", 2) + Chr(13)
    текстПисьма = текстПисьма + "" + Chr(13)
    текстПисьма = текстПисьма + "" + getFromAddrBook("РД,КИп", 2) + Chr(13)
    текстПисьма = текстПисьма + "" + Chr(13)
    текстПисьма = текстПисьма + "Уважаемые сотрудники," + Chr(13)
    текстПисьма = текстПисьма + "" + Chr(13)
    текстПисьма = текстПисьма + "Объем кредитного портфеля Ипотеки с изменениями за период:" + Chr(13)
    текстПисьма = текстПисьма + "" + Chr(13)
    
    ' Анализируем день недели
    
    ' Понедельник - цель на неделю
    If Weekday(Date, vbMonday) = 1 Then
      текстПисьма = текстПисьма + "- целевой ориентир по выдачам на " + remDayWorkWeek(Now) + " " + CStr(Round((ThisWorkbook.Sheets("Лист3").Range("I83").Value - ThisWorkbook.Sheets("Лист3").Range("J83").Value) / 1000, 1)) + " млн.руб." + Chr(13)
    End If
    
    ' Вторник, Среда, Четверг, Пятница - % и сколько сделать до конца недели
    If Weekday(Date, vbMonday) <> 1 Then
      текстПисьма = текстПисьма + "- исполнение плана недели по объему выдачи на сегодня " + CStr(Round(ThisWorkbook.Sheets("Лист3").Range("M83").Value * 100, 0)) + _
        "%, целевой ориентир по выдачам на " + remDayWorkWeek(Now) + " " + CStr(Round((ThisWorkbook.Sheets("Лист3").Range("I83").Value - ThisWorkbook.Sheets("Лист3").Range("J83").Value) / 1000, 1)) + " млн.руб." + Chr(13)
    End If
      
    текстПисьма = текстПисьма + "" + Chr(13)
    текстПисьма = текстПисьма + "" + Chr(13)
    ' Визитка (подпись С Ув., )
    текстПисьма = текстПисьма + ПодписьВПисьме()
    ' Хэштег
    текстПисьма = текстПисьма + createBlankStr(30) + hashTag
    
    ' Вызов
    Call send_Lotus_Notes(темаПисьма, "Sergey Fedorovich Proschaev/Tyumen/PSBank/Ru", "Sergey Fedorovich Proschaev/Tyumen/PSBank/Ru", текстПисьма, attachmentFile)
  
    ' Сообщение
    MsgBox ("Письмо отправлено!")
     
  End If
  
End Sub




' Переход к Форме 2 Листа на ПК
Sub ПК_к_Форме2()
  ActiveWindow.SmallScroll Down:=32
  ThisWorkbook.Sheets("Лист3").Cells(56, 13).Select
End Sub

' Переход к Форме 2.2 Листа на ПК
Sub ПК_к_Форме2_2()
  ActiveWindow.SmallScroll Down:=64
  ThisWorkbook.Sheets("Лист3").Cells(65, 18).Select
End Sub

' Переход к Форме 3 Листа на ПК (ПЗ)
Sub ПК_к_Форме3()
  ActiveWindow.SmallScroll Down:=96
  ThisWorkbook.Sheets("Лист3").Cells(102, 13).Select
End Sub

' Программы - вывод в таблицу из-за ошибки ("Procedure too large")
Sub writeInfoToTable(In_Row, In_Офис_ПК_Выдачи_Месяц_руб_PA, In_Офис_ПК_Выдачи_Месяц_руб_ОПК, In_Офис_ПК_Выдачи_Месяц_руб_Спецкомпании, In_Офис_ПК_Выдачи_Месяц_руб_Госслужащие, In_Офис_ПК_Выдачи_Месяц_руб_Зеленые, In_Офис_ПК_Выдачи_Месяц_руб_Зарплатный_продукт, In_Офис_ПК_Выдачи_Месяц_руб_Особые_отношения, In_Офис_ПК_Выдачи_Месяц_руб_Проверено_временем, In_Офис_ПК_Выдачи_Месяц_руб_Открытый_рынок, In_Офис_ПК_Выдачи_Месяц_руб_Турбо_деньги, In_Офис_ПК_Выдачи_Месяц_руб_Прочие_программы)
    
    ThisWorkbook.Sheets("Лист3").Cells(In_Row, 3).Value = Round(In_Офис_ПК_Выдачи_Месяц_руб_PA / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(In_Row, 4).Value = Round(In_Офис_ПК_Выдачи_Месяц_руб_ОПК / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(In_Row, 5).Value = Round(In_Офис_ПК_Выдачи_Месяц_руб_Спецкомпании / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(In_Row, 6).Value = Round(In_Офис_ПК_Выдачи_Месяц_руб_Госслужащие / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(In_Row, 7).Value = Round(In_Офис_ПК_Выдачи_Месяц_руб_Зеленые / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(In_Row, 8).Value = Round(In_Офис_ПК_Выдачи_Месяц_руб_Зарплатный_продукт / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(In_Row, 9).Value = Round(In_Офис_ПК_Выдачи_Месяц_руб_Особые_отношения / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(In_Row, 10).Value = Round(In_Офис_ПК_Выдачи_Месяц_руб_Проверено_временем / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(In_Row, 11).Value = Round(In_Офис_ПК_Выдачи_Месяц_руб_Открытый_рынок / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(In_Row, 12).Value = Round(In_Офис_ПК_Выдачи_Месяц_руб_Турбо_деньги / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(In_Row, 13).Value = Round(In_Офис_ПК_Выдачи_Месяц_руб_Прочие_программы / 1000, 0)

End Sub

' Программы - вывод в таблицу из-за ошибки ("Procedure too large")
Sub writeInfoToTable2(In_Row, In_Офис_ПК_Выдачи_Месяц_шт_PA)
    
    ThisWorkbook.Sheets("Лист3").Cells(In_Row, 17).Value = In_Офис_ПК_Выдачи_Месяц_шт_PA

End Sub


' Генерация текста в заголовках
Sub generateTextInHeader(In_максимальная_Дата_выдачи_кредита, In_dateBeginWeek, In_dateEndWeek, In_начальная_Дата_года_из_Indicators, In_предидущая_Дата_из_Indicators)

    ' Оперативная бизнес-справка (активы) на <...>
    ThisWorkbook.Sheets("Лист3").Cells(2, 2).Value = "Оперативная бизнес-справка (активы) на " + CStr(In_максимальная_Дата_выдачи_кредита) + " г."
    ThisWorkbook.Sheets("Лист3").Cells(34, 2).Value = "Оперативная бизнес-справка (активы) на " + CStr(In_максимальная_Дата_выдачи_кредита) + " г."
    ThisWorkbook.Sheets("Лист3").Cells(66, 2).Value = "Оперативная бизнес-справка (активы) на " + CStr(In_максимальная_Дата_выдачи_кредита) + " г."
    
    ' Заносим даты в заголовки C5, Факт на <...>
    ThisWorkbook.Sheets("Лист3").Cells(5, 3).Value = "Факт на " + Mid(CStr(In_максимальная_Дата_выдачи_кредита), 1, 5)
    
    ' По штукам
    ThisWorkbook.Sheets("Лист3").Cells(5, 17).Value = "Факт на " + Mid(CStr(In_максимальная_Дата_выдачи_кредита), 1, 5)
    ThisWorkbook.Sheets("Лист3").Cells(18, 17).Value = "Факт на " + Mid(CStr(In_максимальная_Дата_выдачи_кредита), 1, 5)
    
    ThisWorkbook.Sheets("Лист3").Cells(69, 3).Value = "Факт на " + Mid(CStr(In_максимальная_Дата_выдачи_кредита), 1, 5)
    ThisWorkbook.Sheets("Лист3").Cells(37, 3).Value = "Факт на " + Mid(CStr(In_максимальная_Дата_выдачи_кредита), 1, 5)
    ThisWorkbook.Sheets("Лист3").Cells(69, 3).Value = "Факт на " + Mid(CStr(In_максимальная_Дата_выдачи_кредита), 1, 5)
    
    
    ' Выдачи квартала
    ThisWorkbook.Sheets("Лист3").Cells(68, 5).Value = "     Выдачи " + quarterName(In_максимальная_Дата_выдачи_кредита) + ", тыс.руб."
    ThisWorkbook.Sheets("Лист3").Cells(81, 5).Value = "     Выдачи " + quarterName(In_максимальная_Дата_выдачи_кредита) + ", тыс.руб."
    '
    ThisWorkbook.Sheets("Лист3").Cells(81, 18).Value = "     Выдачи " + quarterName(In_максимальная_Дата_выдачи_кредита) + ", шт."
        
    ' Выдачи месяца (февраль),                                                                           тыс.руб.
    ThisWorkbook.Sheets("Лист3").Cells(36, 5).Value = " Выдачи месяца (" + ИмяМесяца(In_максимальная_Дата_выдачи_кредита) + "),                                                                           тыс.руб."
    ThisWorkbook.Sheets("Лист3").Cells(68, 7).Value = "    Выдачи месяца (" + ИмяМесяца(In_максимальная_Дата_выдачи_кредита) + "),   тыс.руб."
    ThisWorkbook.Sheets("Лист3").Cells(81, 7).Value = "    Выдачи месяца (" + ИмяМесяца(In_максимальная_Дата_выдачи_кредита) + "),   тыс.руб."
    '
    ThisWorkbook.Sheets("Лист3").Cells(81, 20).Value = "    Выдачи месяца (" + ИмяМесяца(In_максимальная_Дата_выдачи_кредита) + "),   шт."
                                    
                    
    ' Выдачи недели
    ThisWorkbook.Sheets("Лист3").Cells(36, 7).Value = "Выдачи недели (" + CStr(WeekNumber(In_максимальная_Дата_выдачи_кредита)) + ")                         с " + strDDMM(In_dateBeginWeek) + " по " + strDDMM(In_dateEndWeek) + ", тыс.руб."
    ThisWorkbook.Sheets("Лист3").Cells(68, 9).Value = "           Выдачи недели (" + CStr(WeekNumber(In_максимальная_Дата_выдачи_кредита)) + ")              с " + strDDMM(In_dateBeginWeek) + " по " + strDDMM(In_dateEndWeek) + ", тыс.руб."
    ThisWorkbook.Sheets("Лист3").Cells(81, 9).Value = ThisWorkbook.Sheets("Лист3").Cells(68, 9).Value

    
    ' Заносим даты в заголовки I4, <...>, тыс. руб.
    ThisWorkbook.Sheets("Лист3").Cells(4, 9).Value = "Выдачи дня,             " + Mid(CStr(In_максимальная_Дата_выдачи_кредита), 1, 5)
    ThisWorkbook.Sheets("Лист3").Cells(36, 9).Value = "Выдачи дня,             " + Mid(CStr(In_максимальная_Дата_выдачи_кредита), 1, 5)
    ThisWorkbook.Sheets("Лист3").Cells(68, 11).Value = "Выдачи дня,  " + Mid(CStr(In_максимальная_Дата_выдачи_кредита), 1, 5)
    ThisWorkbook.Sheets("Лист3").Cells(81, 11).Value = ThisWorkbook.Sheets("Лист3").Cells(68, 11).Value
    
    ' Прирост с In_начальная_Дата_года_из_Indicators
    ThisWorkbook.Sheets("Лист3").Cells(5, 4).Value = "Прирост с " + Mid(CStr(In_начальная_Дата_года_из_Indicators), 1, 5)
    ThisWorkbook.Sheets("Лист3").Cells(37, 4).Value = "Прирост с " + Mid(CStr(In_начальная_Дата_года_из_Indicators), 1, 5)
    
    ' Выдачи месяца Изм.
    ThisWorkbook.Sheets("Лист3").Cells(5, 7).Value = "Изм. с " + Mid(CStr(In_предидущая_Дата_из_Indicators), 1, 5)
    
    ' Факт по плану прироста
    ThisWorkbook.Sheets("Лист3").Cells(5, 6).Value = "Факт на " + Mid(CStr(In_максимальная_Дата_выдачи_кредита), 1, 5)
    ThisWorkbook.Sheets("Лист3").Cells(37, 6).Value = "Факт на " + Mid(CStr(In_максимальная_Дата_выдачи_кредита), 1, 5)
    ThisWorkbook.Sheets("Лист3").Cells(69, 6).Value = "Факт на " + Mid(CStr(In_максимальная_Дата_выдачи_кредита), 1, 5)
    ThisWorkbook.Sheets("Лист3").Cells(69, 8).Value = "Факт на " + Mid(CStr(In_максимальная_Дата_выдачи_кредита), 1, 5)
    
    ' Ипотека: Заносим даты в заголовки C5, Факт на <...>
    ThisWorkbook.Sheets("Лист3").Cells(18, 3).Value = "Факт на " + Mid(CStr(In_максимальная_Дата_выдачи_кредита), 1, 5)
    ThisWorkbook.Sheets("Лист3").Cells(50, 3).Value = "Факт на " + Mid(CStr(In_максимальная_Дата_выдачи_кредита), 1, 5)
    ThisWorkbook.Sheets("Лист3").Cells(50, 6).Value = "Факт на " + Mid(CStr(In_максимальная_Дата_выдачи_кредита), 1, 5)
    ThisWorkbook.Sheets("Лист3").Cells(82, 3).Value = "Факт на " + Mid(CStr(In_максимальная_Дата_выдачи_кредита), 1, 5)
    ThisWorkbook.Sheets("Лист3").Cells(82, 6).Value = "Факт на " + Mid(CStr(In_максимальная_Дата_выдачи_кредита), 1, 5)
   
    ' Выдачи месяца
    ThisWorkbook.Sheets("Лист3").Cells(49, 5).Value = " Выдачи месяца (" + ИмяМесяца(In_максимальная_Дата_выдачи_кредита) + "),                                                                           тыс.руб."
        
    ' Ипотека: Выдачи недели
    ThisWorkbook.Sheets("Лист3").Cells(49, 7).Value = "Выдачи недели (" + CStr(WeekNumber(In_максимальная_Дата_выдачи_кредита)) + ")                         с " + strDDMM(In_dateBeginWeek) + " по " + strDDMM(In_dateEndWeek) + ", тыс.руб."
      
    ' Ипотека: Заносим даты в заголовки I4, <...>, тыс. руб.
    ThisWorkbook.Sheets("Лист3").Cells(17, 9).Value = "Выдачи дня,             " + Mid(CStr(In_максимальная_Дата_выдачи_кредита), 1, 5)
    ThisWorkbook.Sheets("Лист3").Cells(49, 9).Value = "Выдачи дня,             " + Mid(CStr(In_максимальная_Дата_выдачи_кредита), 1, 5)
    
    
    ' Ипотека: Прирост с <...> - пред_In_максимальная_Дата_выдачи_кредита
    ThisWorkbook.Sheets("Лист3").Cells(18, 4).Value = "Прирост с " + Mid(CStr(In_начальная_Дата_года_из_Indicators), 1, 5)
    ThisWorkbook.Sheets("Лист3").Cells(50, 4).Value = "Прирост с " + Mid(CStr(In_начальная_Дата_года_из_Indicators), 1, 5)
    ThisWorkbook.Sheets("Лист3").Cells(82, 4).Value = "Прирост с " + Mid(CStr(In_начальная_Дата_года_из_Indicators), 1, 5)
        
    ' Ипотека: Выдачи месяца Изм.
    ThisWorkbook.Sheets("Лист3").Cells(18, 7).Value = "Изм. с " + Mid(CStr(In_предидущая_Дата_из_Indicators), 1, 5)
    ' Ипотека: Факт по плану прироста
    ThisWorkbook.Sheets("Лист3").Cells(18, 6).Value = "Факт на " + Mid(CStr(In_максимальная_Дата_выдачи_кредита), 1, 5)
                                    
End Sub

' Генерация текста в итогах - только по Тюмени пока
Sub generateTextInTotal(In_максимальная_Дата_выдачи_кредита, ИЦ_Факт_руб, ИЦ_Факт_шт, ИЦ_Выдачи_Месяц_руб, ИЦ_Выдачи_Месяц_шт, ИЦ_Выдачи_Дата_руб, ИЦ_Выдачи_Дата_шт, ИЦ_Выдачи_Неделя_руб, ИЦ_Выдачи_Неделя_шт, ИЦ_Выдачи_Квартал_руб, ИЦ_Выдачи_Квартал_шт, ИЦ_628400_Факт_руб, ИЦ_628400_Факт_шт, ИЦ_628400_Выдачи_Месяц_руб, ИЦ_628400_Выдачи_Месяц_шт, ИЦ_628400_Выдачи_Дата_руб, ИЦ_628400_Выдачи_Дата_шт, ИЦ_628400_Выдачи_Неделя_руб, ИЦ_628400_Выдачи_Неделя_шт, ИЦ_628400_Выдачи_Квартал_руб, ИЦ_628400_Выдачи_Квартал_шт)

    ' ИЦ Факт на ...
    ThisWorkbook.Sheets("Лист3").Cells(19, 3).Value = Round(ИЦ_Факт_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(19, 17).Value = ИЦ_Факт_шт
        
    ThisWorkbook.Sheets("Лист3").Cells(51, 3).Value = Round(ИЦ_Факт_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(83, 3).Value = Round(ИЦ_Факт_руб / 1000, 0)
    
    ' в т.ч. Сургут
    ThisWorkbook.Sheets("Лист3").Cells(20, 3).Value = Round(ИЦ_628400_Факт_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(20, 17).Value = ИЦ_628400_Факт_шт
    
    ' ИЦ Факт месяц
    ThisWorkbook.Sheets("Лист3").Cells(19, 6).Value = Round(ИЦ_Выдачи_Месяц_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(51, 6).Value = Round(ИЦ_Выдачи_Месяц_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(83, 8).Value = Round(ИЦ_Выдачи_Месяц_руб / 1000, 0)
    
    ' На лист факт Плана: Месяц (1-12), офис 1-5
    Call setResultValue(Month(In_максимальная_Дата_выдачи_кредита), 10, Round(ИЦ_Выдачи_Месяц_руб / 1000, 0))
    
    ' ИЦ Факт Квартал
    ThisWorkbook.Sheets("Лист3").Cells(83, 6).Value = Round(ИЦ_Выдачи_Квартал_руб / 1000, 0)
    ' в т.ч. Сургут
    ThisWorkbook.Sheets("Лист3").Cells(84, 6).Value = Round(ИЦ_628400_Выдачи_Квартал_руб / 1000, 0)
    
    ' в т.ч. Сургут
    ThisWorkbook.Sheets("Лист3").Cells(20, 6).Value = Round(ИЦ_628400_Выдачи_Месяц_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(52, 6).Value = Round(ИЦ_628400_Выдачи_Месяц_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(84, 8).Value = Round(ИЦ_628400_Выдачи_Месяц_руб / 1000, 0)
    
    ' На лист факт Плана: Месяц (1-12), офис 1-5
    Call setResultValue(Month(In_максимальная_Дата_выдачи_кредита), 11, Round(ИЦ_628400_Выдачи_Месяц_руб / 1000, 0))
    
    ' ИЦ Факт дата
    ThisWorkbook.Sheets("Лист3").Cells(19, 9).Value = Round(ИЦ_Выдачи_Дата_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(19, 10).Value = ИЦ_Выдачи_Дата_шт
    ThisWorkbook.Sheets("Лист3").Cells(51, 9).Value = Round(ИЦ_Выдачи_Дата_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(51, 10).Value = ИЦ_Выдачи_Дата_шт
    ThisWorkbook.Sheets("Лист3").Cells(83, 11).Value = Round(ИЦ_Выдачи_Дата_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(83, 12).Value = ИЦ_Выдачи_Дата_шт
    
    ' в т.ч. Сургут
    ThisWorkbook.Sheets("Лист3").Cells(20, 9).Value = Round(ИЦ_628400_Выдачи_Дата_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(20, 10).Value = ИЦ_628400_Выдачи_Дата_шт
    ThisWorkbook.Sheets("Лист3").Cells(52, 9).Value = Round(ИЦ_628400_Выдачи_Дата_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(52, 10).Value = ИЦ_628400_Выдачи_Дата_шт
    ThisWorkbook.Sheets("Лист3").Cells(84, 11).Value = Round(ИЦ_628400_Выдачи_Дата_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(84, 12).Value = ИЦ_628400_Выдачи_Дата_шт

End Sub


' Вывод данных по ОО Тюменский
Sub generateTextInBody(In_максимальная_Дата_выдачи_кредита, Тюменский_ПК_Факт_руб, Тюменский_ПК_Факт_шт, Тюменский_ПК_Факт_руб_пред, Тюменский_ПК_Выдачи_Месяц_руб, Тюменский_ПК_Выдачи_Месяц_шт, Тюменский_ПК_Выдачи_Дата_руб, Тюменский_ПК_Выдачи_Дата_шт, Тюменский_ПК_Выдачи_Неделя_руб, Тюменский_ПК_Выдачи_Неделя_шт, Тюменский_ПК_Выдачи_Квартал_руб, Тюменский_ПК_Выдачи_Квартал_шт)

    ' ПК Факт на ...
    ThisWorkbook.Sheets("Лист3").Cells(6, 3).Value = Round(Тюменский_ПК_Факт_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(6, 17).Value = Тюменский_ПК_Факт_шт
    
    ThisWorkbook.Sheets("Лист3").Cells(38, 3).Value = Round(Тюменский_ПК_Факт_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(70, 3).Value = Round(Тюменский_ПК_Факт_руб / 1000, 0)
    
    ' ПК Факт месяц
    ThisWorkbook.Sheets("Лист3").Cells(6, 6).Value = Round(Тюменский_ПК_Выдачи_Месяц_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(38, 6).Value = Round(Тюменский_ПК_Выдачи_Месяц_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(70, 8).Value = Round(Тюменский_ПК_Выдачи_Месяц_руб / 1000, 0)
    
    ' На лист факт Плана: Месяц (1-12), офис 1-5
    Call setResultValue(Month(In_максимальная_Дата_выдачи_кредита), 1, Round(Тюменский_ПК_Выдачи_Месяц_руб / 1000, 0))
    
    ' ПК Факт дата
    ThisWorkbook.Sheets("Лист3").Cells(6, 9).Value = Round(Тюменский_ПК_Выдачи_Дата_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(6, 10).Value = Тюменский_ПК_Выдачи_Дата_шт
    ThisWorkbook.Sheets("Лист3").Cells(38, 9).Value = Round(Тюменский_ПК_Выдачи_Дата_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(38, 10).Value = Тюменский_ПК_Выдачи_Дата_шт
    ThisWorkbook.Sheets("Лист3").Cells(70, 11).Value = Round(Тюменский_ПК_Выдачи_Дата_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(70, 12).Value = Тюменский_ПК_Выдачи_Дата_шт
            
    ' План на неделю - 6 дней
    ' ThisWorkbook.Sheets("Лист3").Cells(38, 7).Value = Round(ПланНаНеделю(ThisWorkbook.Sheets("Лист3").Cells(38, 5).Value, ThisWorkbook.Sheets("Лист3").Cells(38, 6).Value - ThisWorkbook.Sheets("Лист3").Cells(38, 8).Value, максимальная_Дата_выдачи_кредита, 6), 0)
    ' План на неделю - 5 дней
    ThisWorkbook.Sheets("Лист3").Cells(38, 7).Value = Round(ПланНаНеделю(ThisWorkbook.Sheets("Лист3").Cells(38, 5).Value, ThisWorkbook.Sheets("Лист3").Cells(38, 6).Value - ThisWorkbook.Sheets("Лист3").Cells(38, 8).Value, In_максимальная_Дата_выдачи_кредита, 5), 0)
    ThisWorkbook.Sheets("Лист3").Cells(70, 9).Value = Round(ПланНаНеделю(ThisWorkbook.Sheets("Лист3").Cells(38, 5).Value, ThisWorkbook.Sheets("Лист3").Cells(38, 6).Value - ThisWorkbook.Sheets("Лист3").Cells(38, 8).Value, In_максимальная_Дата_выдачи_кредита, 5), 0)
                        
    ' ПК Факт неделя
    ThisWorkbook.Sheets("Лист3").Cells(38, 8).Value = Round(Тюменский_ПК_Выдачи_Неделя_руб / 1000, 0)
    ThisWorkbook.Sheets("Лист3").Cells(70, 10).Value = Round(Тюменский_ПК_Выдачи_Неделя_руб / 1000, 0)
    
    ' ПК Факт Квартал
    ThisWorkbook.Sheets("Лист3").Cells(70, 6).Value = Round(Тюменский_ПК_Выдачи_Квартал_руб / 1000, 0)

End Sub


' Копия таблицы по Ипотеке в файл для отправки
Sub Copy_Активы_Ипотека()
  
  Application.StatusBar = "Копия файла для ИЦ..."
  
  ' В U3 заносим имя файла
  
  ' Открываем шаблон "Ежедневный отчет.xlsx"
  If Dir(ThisWorkbook.Path + "\Templates\" + "Портфель_ИЦ.xlsx") <> "" Then
    ' Открываем шаблон Templates\Ежедневный отчет по продажам
    TemplatesFileName = "Портфель_ИЦ"
  End If
              
  ' Открываем шаблон Протокола из C:\Users\...\Documents\#VBA\DB_Result\Templates
  Workbooks.Open (ThisWorkbook.Path + "\Templates\" + TemplatesFileName + ".xlsx")
           
  ' Переходим на окно DB
  ThisWorkbook.Sheets("Лист3").Activate

  ' Имя нового файла
  FileDBName = "Выдачи и портфель ИЦ " + strДД_MM_YY(ThisWorkbook.Sheets("Лист3").Range("W1").Value) + ".xlsx"
  Workbooks(TemplatesFileName).SaveAs FileName:=ThisWorkbook.Path + "\Out\" + FileDBName, FileFormat:=xlOpenXMLWorkbook, createBackUp:=False
  ThisWorkbook.Sheets("Лист3").Range("U3").Value = ThisWorkbook.Path + "\Out\" + FileDBName
           
            
  ' *** Копирование данных ***
  
  ' *** Заголовки
  ' "C6" "Кредитный портфель Ипотека, тыс. руб." "Факт на ____"
  Workbooks(FileDBName).Sheets("Лист1").Range("C6").Value = ThisWorkbook.Sheets("Лист3").Range("C82").Value
  ' "E5" "     Выдачи __ кв. 20__ г., тыс.руб."
  Workbooks(FileDBName).Sheets("Лист1").Range("E5").Value = ThisWorkbook.Sheets("Лист3").Range("E81").Value
  ' "F6" "Факт на ____"
  Workbooks(FileDBName).Sheets("Лист1").Range("F6").Value = ThisWorkbook.Sheets("Лист3").Range("F82").Value
  ' "G5" "    Выдачи месяца (______),   тыс.руб."
  Workbooks(FileDBName).Sheets("Лист1").Range("G5").Value = ThisWorkbook.Sheets("Лист3").Range("G81").Value
  ' "I5" "           Выдачи недели (__)              с ____ по ____, тыс.руб."
  Workbooks(FileDBName).Sheets("Лист1").Range("I5").Value = ThisWorkbook.Sheets("Лист3").Range("I81").Value
  ' "K5" "Выдачи дня,  ____"
  Workbooks(FileDBName).Sheets("Лист1").Range("K5").Value = ThisWorkbook.Sheets("Лист3").Range("K81").Value
  ' "R5" Выдачи квартал, шт.
  Workbooks(FileDBName).Sheets("Лист1").Range("R5").Value = ThisWorkbook.Sheets("Лист3").Range("R81").Value
  ' "T5" Выдачи квартал, шт.
  Workbooks(FileDBName).Sheets("Лист1").Range("T5").Value = ThisWorkbook.Sheets("Лист3").Range("T81").Value
  
  ' *** Данные
  For j = 1 To 25
      
    ThisWorkbook.Sheets("Лист3").Cells(83, j).Copy Destination:=Workbooks(FileDBName).Sheets("Лист1").Cells(7, j)
      
  Next j
  
  ' Перезаписываем значения (формулы)
  ' E83
  Workbooks(FileDBName).Sheets("Лист1").Range("E7").Value = ThisWorkbook.Sheets("Лист3").Range("E83").Value
  ' G83
  Workbooks(FileDBName).Sheets("Лист1").Range("G7").Value = ThisWorkbook.Sheets("Лист3").Range("G83").Value
  ' M83
  Workbooks(FileDBName).Sheets("Лист1").Range("M7").Value = ThisWorkbook.Sheets("Лист3").Range("M83").Value
  ' N83
  Workbooks(FileDBName).Sheets("Лист1").Range("N7").Value = ThisWorkbook.Sheets("Лист3").Range("N83").Value
  ' O83
  Workbooks(FileDBName).Sheets("Лист1").Range("O7").Value = ThisWorkbook.Sheets("Лист3").Range("O83").Value
  ' P83
  Workbooks(FileDBName).Sheets("Лист1").Range("P7").Value = ThisWorkbook.Sheets("Лист3").Range("P83").Value
  ' Q83
  Workbooks(FileDBName).Sheets("Лист1").Range("Q7").Value = ThisWorkbook.Sheets("Лист3").Range("Q83").Value
  ' V83
  Workbooks(FileDBName).Sheets("Лист1").Range("V7").Value = ThisWorkbook.Sheets("Лист3").Range("V83").Value
  ' W83
  Workbooks(FileDBName).Sheets("Лист1").Range("W7").Value = ThisWorkbook.Sheets("Лист3").Range("W83").Value
  ' X83
  Workbooks(FileDBName).Sheets("Лист1").Range("X7").Value = ThisWorkbook.Sheets("Лист3").Range("X83").Value
  ' Y83
  Workbooks(FileDBName).Sheets("Лист1").Range("Y7").Value = ThisWorkbook.Sheets("Лист3").Range("Y83").Value
  
  ' ***
                    
  ' Закрытие файла
  Workbooks(FileDBName).Close SaveChanges:=True

  
  Application.StatusBar = ""
  
End Sub

' Печать отчета
Sub Печать_Лист3_ИЦ()
    
  ' Запрос
  If MsgBox("Напечатать по ИЦ?", vbYesNo) = vbYes Then
    
      ' ИЦ
      Range("A80:Y84").Select
      Selection.PrintOut Copies:=1, Collate:=True
      
    
  End If
    
End Sub

